[
  {
    "id": "review_0",
    "rating": 5,
    "date": "2025-10-16",
    "location": null,
    "country": "Unknown",
    "comment": "I had super much fun! My kids enjoyed the stay so much and the football coach/entertainer was really nice and very fun!",
    "mainClasses": [
      "Amenities",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Joy"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_1",
    "rating": 5,
    "date": "2025-10-16",
    "location": "Pontefract, United Kingdom",
    "country": "United Kingdom",
    "comment": "Amazing staff especially towel lady Ayşe. I love her smile she is so lovely.",
    "mainClasses": [
      "Amenities",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Love"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_2",
    "rating": 5,
    "date": "2025-10-16",
    "location": null,
    "country": "Unknown",
    "comment": "Beautiful hotel - the staff were helpful and the food and facilities were excellent. The choice of activities available and entertainment were just right. The fireworks were an added extra!",
    "mainClasses": [
      "Amenities",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Approval",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_3",
    "rating": 5,
    "date": "2025-10-16",
    "location": null,
    "country": "Unknown",
    "comment": "We’re currently staying at the Titanic Deluxe Lara, and honestly, it’s been nothing short of amazing, despite the change of rooms on the first night (it was too small). The whole place is stunning — beautifully maintained, spotless, and full of energy. Every single member of staff goes out of their way to make you feel welcome and relaxed. The highlight of our trip so far has definitely been the cabana service. Having our own private cabana by the pool has made our holiday feel truly luxurious — comfortable loungers, chilled drinks, delicious snacks, and the most attentive staff we’ve ever come across. Our cabana host Hüseyin has been incredible, always checking in to make sure we have everything we need before we even have to ask. The food and drinks throughout the resort are top quality, with so much variety that every meal feels different. The atmosphere is perfect — lively when you want it to be, but peaceful when you just want to unwind. Every detail here is so well thought out, and you can tell the staff genuinely care about guests having a great experience. We’ve already said we’ll 100% be coming back — it’s the perfect mix of luxury, comfort, and fun. If you’re thinking about booking Titanic Deluxe Lara, don’t hesitate — and definitely treat yourself to the cabana experience. It’s worth every penny and has made our stay unforgettable.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Cleanliness",
      "Entertainment",
      "Neighborhood",
      "Overall Value",
      "Pool",
      "Quality",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude",
      "Joy",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_4",
    "rating": 5,
    "date": "2025-10-16",
    "location": null,
    "country": "Unknown",
    "comment": "Great family hotel, lots of things to do for the kids, kids club with soft play is ace. Keeps little ones busy. For adults great food and a great selection of drinks. Areas clean and the teams around hotel are very nice and friendly.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value",
      "Quality"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_5",
    "rating": 5,
    "date": "2025-10-16",
    "location": "Blackpool, United Kingdom",
    "country": "United Kingdom",
    "comment": "Very nice hotel amazing staff, service is 5* \nI usually struggle to drink AI drinks not here, looking to return next year \nBeautiful weather \nStaff really care about you \nNothing at all was a problem",
    "mainClasses": [
      "Service"
    ],
    "subClasses": [
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_6",
    "rating": 5,
    "date": "2025-10-15",
    "location": null,
    "country": "Unknown",
    "comment": "Das Hotel ist super, es ist sehr unterhaltsam. Viele Aktivitäten zum machen und immer ein super Abendprogramm. Sehr weiter zu empfehlen für Familie und Jugendliche. and enterteiner yigit was amaying",
    "mainClasses": [
      "Amenities",
      "Location",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value",
      "Proximity to Attractions"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_7",
    "rating": 5,
    "date": "2025-10-15",
    "location": null,
    "country": "Unknown",
    "comment": "Wir sind zum 11. Mal im Titanic Deluxe in Lara und  erneut sind es traumhafte Ferien. Wie in all den Jahren zuvor haben wir für unseren gesamten Aufenthalt eine Beach Cabana genommen. Der Cabana Service ist excellent, vor allem die Arbeit von Ahmed aber auch von allen anderen Mitarbeitern ist perfekt. Immer sehr leckeres Mittagessen am Strand und die Cocktails von Ahmed und Aziz könnten nicht besser sein. Es wird einem jeder Wunsch von den Augen abgelesen. Diesmal haben wir zwei Zimmer gebucht, beide sind riesig und zu 100% sauber dank dem tollen Housekeeping welches jeden Tag tolle Arbeit leistet. Vielen Dank an Murat, Ahmed, Aziz und Merve für alles! Bis bald wieder :)",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Beach",
      "Housekeeping",
      "Overall Value",
      "Proximity to Attractions",
      "Restaurant",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Desire",
      "Gratitude",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_8",
    "rating": 5,
    "date": "2025-10-15",
    "location": null,
    "country": "Unknown",
    "comment": "Angela is the best entertainment for anyone playing darts  and she is also very good at playing it also and adnan is also very very good entertainment team member he is always having good laughs with us and mustafa bar waiter is very pleasant young man and looked after me so much",
    "mainClasses": [
      "Service"
    ],
    "subClasses": [
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_9",
    "rating": 5,
    "date": "2025-10-15",
    "location": null,
    "country": "Unknown",
    "comment": "Wie immer ist es eine positives Erlebnis hier. Es ist sozusagen unser zweites zu Hause. Sauberkeit, Freundlichkeit und gute Unterhaltung. Wir kommen schon seit Jahren und werden es auch weiterhin tun.",
    "mainClasses": [
      "Location",
      "Room",
      "Service"
    ],
    "subClasses": [
      "Bed",
      "Neighborhood",
      "Proximity to Attractions",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Approval",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Location"
  },
  {
    "id": "review_10",
    "rating": 5,
    "date": "2025-10-15",
    "location": "Frankfurt, Germany",
    "country": "Germany",
    "comment": "Erste mal im Titanic mit Familie. Early Check in sehr gut. Buffet Auswahl sehr gut und internationale Küche.",
    "mainClasses": [
      "Food",
      "Location",
      "Value"
    ],
    "subClasses": [
      "Neighborhood",
      "Overall Value",
      "Quality"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Food"
  },
  {
    "id": "review_11",
    "rating": 3,
    "date": "2025-10-14",
    "location": null,
    "country": "Unknown",
    "comment": "Currently staying here as a group of 5 adults and 2 toddlers and are utterly disappointed with the hotel. Having stayed at another hotel (Trendy Lara) in Lara Beach 3 months ago and had a great experience, we decided to push the boat out a little more for this trip as the reason for the holiday was to celebrate my Dad’s 70th Birthday which falls during the stay. We paid around £400 each more for this hotel than we could have got the Trendy Lara and based on reviews we thought we were going for a more deluxe holiday experience, this has been far from the case. We arrived 10 mins after the main restaurant had closed and were made aware that we’d have to wait 1.5 hours for the midnight snack bar to open in order to have anything to eat. We had 2 hungry toddlers with us, who needed to be fed and put to bed so this was far from ideal. Having stayed at loads of all inclusive resorts all over Europe, I’ve never know one not keep part of the restaurant open with a limited selection of food available for guest arriving late, even 3 star resorts offer this as standard. After some complaining, the staff agreed to arrange room service for us however, it took so long to arrive that we were only 10 mins off the snack bar opening. The hotel is generally tired and worn, in need of updating. The door to the balcony in one of our rooms is broken and coming away from the frame, letting in a draught and noise. The kids tables and chairs in the restaurant have seen much better days. Generally everything is just in need of a revamp. The staff are “fine”, not rude for the most part (although a couple have been) but not particularly friendly either. Drinks Service and clearing tables is very slow in the main restaurant, particularly at breakfast when we’ve had to go hunt down someone to place drink orders every day so far, because there is no self service option. The food is “fine” but nothing special. All very luke warm, pretty much the same every night. Pretty standard all inclusive except that this is meant to be a 5* resort and by comparison to our experience at the other hotel a few months back, falls very short. There, we had so much more choice, so many stations where food was prepared fresh, variety from one night to the next and food was actually hot. There are a few additional options for lunch, down towards the beach. We had to queue for a while for the Italian lunch restaurant and then half the table’s food was brought over so long before the other half that they’d finished eating before the others had received theirs. The staff didn’t seem at all bothered by our frustration over this, as 3 adults had finished their food whilst 2 adults and 2 toddlers were sat waiting for theirs. There are a la carte restaurant options during the evenings, but all at a cost. The one thing they do have that exceeds our experience elsewhere is the kids club. This has been recently refurbished and includes a great soft play and lots of activity rooms, which are all very clean and full of things to keep the kids entertained. Generally, the hotel is “fine”. Nothing at all special, no extra little bits that you’d expect from a 5* resort to elevate the experience. It is a 4* resort at best and absolutely not worth the extra money. Save your money and go to Trendy Lara or one of the other resorts in the area. We’re so gutted that we “splashed out” on this as a treat for a special occasion, expecting my Dad’s 70th to be something truly special, when this just won’t be the case.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Bar",
      "Bed",
      "Entertainment",
      "Fees",
      "Neighborhood",
      "Noise",
      "Overall Value",
      "Price",
      "Proximity to Attractions",
      "Quality",
      "Restaurant",
      "Room Service",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Approval",
      "Caring",
      "Desire",
      "Disappointment",
      "Disapproval",
      "Joy",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_12",
    "rating": 5,
    "date": "2025-10-14",
    "location": null,
    "country": "Unknown",
    "comment": "Wat een heerlijke luxe ervaring! Het eten is goed, de zwembaden zijn prachtig en vooral: het personeel is onwijs vriendelijk. Niks is te moeilijk of teveel gevraagd. Enne, boek die cabana aan het zwembad!",
    "mainClasses": [
      "Amenities",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value",
      "Pool"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Disappointment",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_13",
    "rating": 5,
    "date": "2025-10-14",
    "location": "Maassluis, The Netherlands",
    "country": "The Netherlands",
    "comment": "Great food, great people kom hier zeker terug! Het zwembad water is wat koud maar verder weinig te klagen!",
    "mainClasses": [
      "Amenities",
      "Food"
    ],
    "subClasses": [
      "Pool",
      "Quality"
    ],
    "sentiments": [
      "Negative",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_14",
    "rating": 5,
    "date": "2025-10-13",
    "location": null,
    "country": "Unknown",
    "comment": "Amazing hotel, amazing staff!! Me and the kids absolutely love it here, the whole place is spotless. The food is gorgeous also. Thankyou so much Titanic delux Lara we will defo be back 😊",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Service"
    ],
    "subClasses": [
      "Entertainment",
      "Neighborhood",
      "Quality",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude",
      "Love"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_15",
    "rating": 4,
    "date": "2025-10-13",
    "location": null,
    "country": "Unknown",
    "comment": "As someone who is apprehensive about what I book, i can honestly say this is a beautiful hotel. There is a few points that can be worked on but I will give the good and the bad. Good :\n• Clean facilities, overall well maintained hotel. • Clean towels and pool towels daily. • Entertainment for children and the kids club is amazing. • Pool and loungers and high quality and lots to do by the pool. Option of relaxing areas as well as kids pools and music playing. •staff by the pool on roller skates, always coming round offering drinks. •drinks were nice and plenty of options. Bad :\n• Food choices limited - we found the buffet especially on the evening to be repetitive and poor quality of food. We really struggled with this and my partner actually felt like he was on rations. Snacks in the day are limited by the pool with only fruit, ice cream or waffles available. Jacket potato bar open 4pm-6pm. If you want nicer food the beach bars are your best bet but again limited timings for this. We really struggled with the food at this hotel. My children didn’t eat very well. •waiters in the buffet were often abrupt/rude. They couldn’t speak very good English and only understood coke or tea/orange juice. They would only come to you once for a drink. I did not find them very helpful. •bar waiters again were abrupt. Only the ones on the roller skates or the ones serving food I found to be polite. The waiters at the beach bars were also rude/abrupt. • storage for clothes in the rooms were very little, struggled as a family of 4 to unpack all of our clothes. There were 3 drawers and about 5 coat hangers. • I wouldn’t say there is loads to do at this hotel. Overall it is a lovely clean hotel. There is a lot that can be improved on especially when it comes to the food.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Bar",
      "Beach",
      "Entertainment",
      "Noise",
      "Overall Value",
      "Pool",
      "Price",
      "Proximity to Attractions",
      "Quality",
      "Restaurant",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Annoyance",
      "Disappointment",
      "Disapproval",
      "Neutral",
      "Sadness"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_16",
    "rating": 5,
    "date": "2025-10-12",
    "location": null,
    "country": "Unknown",
    "comment": "Otele ilk kez geldim çocuklarım ve ben burada çok mutluyuz. Harika bir çocuk kulübü var otelin merkezinde olması harika. Kendi restoranı olması da super bu kaliteli hizmet için çocuklarım adina teşekkür ederim.",
    "mainClasses": [
      "Amenities",
      "Location",
      "Service"
    ],
    "subClasses": [
      "Entertainment",
      "Neighborhood",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude",
      "Joy"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_17",
    "rating": 5,
    "date": "2025-10-12",
    "location": null,
    "country": "Unknown",
    "comment": "Good staff friendly and helpful. Food excellent\nMash potato brilliant\nMunara very good waitress\nVery clean especially toilets\nThank you for all.",
    "mainClasses": [
      "Service"
    ],
    "subClasses": [
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_18",
    "rating": 5,
    "date": "2025-10-12",
    "location": null,
    "country": "Unknown",
    "comment": "Staffs are amazing, so pleasant and friendly. Especially towel lady Ayse always smiling. Ersin a la carte Asian is the best. And service always good",
    "mainClasses": [
      "Amenities",
      "Food",
      "Service"
    ],
    "subClasses": [
      "Entertainment",
      "Restaurant",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_19",
    "rating": 5,
    "date": "2025-10-11",
    "location": null,
    "country": "Unknown",
    "comment": "Just come back from a week in this hotel. Amazing hotel, amazing staff, amazing food, the pools are stunning. Couldn't fault anything with the place.",
    "mainClasses": [
      "Amenities",
      "Location"
    ],
    "subClasses": [
      "Accessibility",
      "Pool",
      "Proximity to Attractions"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_20",
    "rating": 5,
    "date": "2025-10-10",
    "location": null,
    "country": "Unknown",
    "comment": "Most importantly the kids club is amazing. Our two year old spend pretty much 80% of her days in the kids club and the staff there is very friendly and attentive to kids. Cabana’s is good too. We hired it for ours daughter’s birthday and it was nice and relaxing experience. Beach is great but the sand is dark so I would keep my footwear on. Food is great, specially the midnight snack restaurant. Bowling bar is perfect to chill. Lots of kids activities during the day, don’t forget to get your child to paint on the t-shirt which you can later take with you, as memory.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Service"
    ],
    "subClasses": [
      "Beach",
      "Entertainment",
      "Restaurant",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Joy",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_21",
    "rating": 2,
    "date": "2025-10-08",
    "location": null,
    "country": "Unknown",
    "comment": "Since my review was deleted - I will reshare! Stayed at the Titanic for 2weeks - non of fell ill even though there was posts prior to our arrival 🥳 So we had big expectation for this hotel, the price tag to this hotel as well was not cheap & we feel utterly disappointed. Where is foam parties, beach parties - theres literally nothing exciting. We were giving room 2105 \"Family Room\" - having that space was incredible but the music from the Titanic & Mircale Hotel going onto early hours.. Who put family rooms here? They are also not accessible even trying to get to the pool. If baby is sleep in pram you need to lift the pram up stairs to get to your room! The kids splash area was fab but take apart from that... the kids club looks great from the outside but at night time it becomes a 'cattle market' - so busy, softplay becomes very busy - bigger kids knocking the small ones over. The park is tiny and again very very busy. I personally did not like the fact the mini disco was away from the bars. All previous holidays its just beeb at the main stage, parents can watch having a drink etc. We also didn't agree that the main entertainment started at 9.45pm! By that time the kids are going off their heads cause they are tired. Trying to keep them up to see the fireworks at 9.45pm for the White Party was stresseful. Drinks were okay, the skater boys round the pool are fab. Bar staff were kind but the restaurant staff - looked like they wished they were elsewhere. Even witnessed the female manager shouting at a staff memeber during breakfast - not very professional. Few days before we were due to depart, we went for dinner. Grab one of those puff pastry deserts that had cream in between - not sure why i opened it. And it was MOULDY! I took a picture of it, showed the head chef who ripped the mould out asking what the issue was. by this point the steam out my ears was about to explode. He took me to 2 other men who wear the white tshirts, they were like where is it. I said he just ripped it out but heres a photo of it - they started talking in turkish, who knows what they were saying. They said it was cheese, i said thats no cheese thats mould from your deserts. I point over and they walked that way again speaking in turkish. So i went screw this & left. Spoke to guest relations who phoned the head chef (who btw is more interested making sure theres nothing stuck inbetween his turkish teeth) and he advised they have been removed, whether they did or not. So if anyone had puff pastry deserts with cream in the middle with blueberries or strawberries on Tues 30th Sept, youve ate mould.. Next day, went for breakfast, the eggs tasted funky, the fruit was hot, the mushrooms that sat in 'a pan' was cold even though we went at 8am for it opening... There is also pieces missing from drainage slates around the pool - while i was holding my child, i went down into one of the holes and hurt my already fractured ankle even more. (Thank you again to those who helped me btw) - spoke to guest relations, didn't care. More interested in me visiting the nurse cause thats money! So by this point I have 3days left of my holiday and i wanted to go home. This is meant to be 5* hotel premium shall we say... I have been to 4* hotels which is better than this. The hotel we went to last year in turkey, had foam parties for the kids, inflatables during the day for the kids etc and we did not want to leave. With this place, i counted the days down. We were disappointed and will never return to this hotel or recommend this. ps - place could be doing with a deep clean!",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Bed",
      "Breakfast",
      "Entertainment",
      "Fees",
      "Neighborhood",
      "Noise",
      "Overall Value",
      "Pool",
      "Price",
      "Proximity to Attractions",
      "Quality",
      "Restaurant",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Confusion",
      "Curiosity",
      "Desire",
      "Disappointment",
      "Disapproval",
      "Excitement",
      "Gratitude",
      "Neutral",
      "Sadness"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_22",
    "rating": 2,
    "date": "2025-10-07",
    "location": "Oslo, Norway",
    "country": "Norway",
    "comment": "I want to share two things that made me not want to come back and that is massive use of one-time plastic and the freezing cold pools. On their webpage it says the hotel dont use one-time plastic but that is not true. I hope they can change that in the future. The pools were very cold, around 18-20 celsius would be my guess, and there were not many people using the pools compared to other hotels where families are a big customer group. In the summer with 40+ it might be nice and cooling, its the only logic to make out of it. The webpage said one pool was heatet, and inside, but not in October anyway. The kids only played in the pools for a few minutes at the time, and I saw that for other tourists as well. The pools was also not suited for children under 140 cm as that was the  lowest dept of all the pools. A tiny baby pool is there in the back, but its not at the pleasent area in the garden. The pools were very lovely though, big and nice, but the temperature made that not matter. Other wise the food was lovely, but its all inclusive which means eating with many others in a noisy room, but that is probably what you know booking this type of hotel. Rooms was lovely, and activities for the children as well. In light of the plastic frustration, some of the drinks they use in the bar to mix drinks/ smoothies are syrup and dont know what they contain, afraid its the cheapest juices one can get, fresh fruit which they had a lot of to eat, would be nice to use in drinks etc.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Bar",
      "Cleanliness",
      "Entertainment",
      "Overall Value",
      "Pool",
      "Restaurant",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Desire",
      "Disapproval",
      "Fear",
      "Love",
      "Neutral",
      "Optimism"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_23",
    "rating": 5,
    "date": "2025-10-07",
    "location": null,
    "country": "Unknown",
    "comment": "Fantastic food, service and the staff were lovely. The hotel and surroundings are spotlessly clean Out room was comfortable, clean and the housekeeping team were excellent",
    "mainClasses": [
      "Amenities",
      "Location",
      "Service"
    ],
    "subClasses": [
      "Entertainment",
      "Neighborhood",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_24",
    "rating": 5,
    "date": "2025-10-07",
    "location": "Berlin, Germany",
    "country": "Germany",
    "comment": "Ich war sehr zufrieden mit meinem Aufenthalt. Das Hotel ist sauber und gepflegt. Besonders hervorheben möchte ich den Service. Das Personal war jederzeit freundlich, aufmerksam und hilfsbereit.",
    "mainClasses": [
      "Location",
      "Service"
    ],
    "subClasses": [
      "Accessibility",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Joy",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Location"
  },
  {
    "id": "review_25",
    "rating": 5,
    "date": "2025-10-06",
    "location": "Kettering, United Kingdom",
    "country": "United Kingdom",
    "comment": "Am here at the moment \nThe hotel is very clean the staff are all very friendly \nDrinks are of  a good quality although the vodka I have at the moment is a little to strong \nThe food as with most all inclusive hotels is a little repetitive but plenty of choices \nGreat hotel would definitely recommend",
    "mainClasses": [
      "Food"
    ],
    "subClasses": [
      "Quality"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Food"
  },
  {
    "id": "review_26",
    "rating": 5,
    "date": "2025-10-06",
    "location": null,
    "country": "Unknown",
    "comment": "Wir kommen mehr mal im Jahr hierher und lueben das Hotel. Auch unsere Kinder lieben das Hotel besonders der Kidsclub ist zu empfehlen. Ein besonder Dank gilt Sevilay. Sie macht das wunderbar mit den Kindern. Wir kommen gerne wieder",
    "mainClasses": [
      "Amenities",
      "Location",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Neighborhood",
      "Overall Value",
      "Proximity to Attractions",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude",
      "Love",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_27",
    "rating": 5,
    "date": "2025-10-06",
    "location": null,
    "country": "Unknown",
    "comment": "Otelden memnun kaldık her şey harika tüm yorumları okuyup geldim sonunda misafir ilişkileri Merve hanım ile tanıştık. Patenci Eyüp işinde çok iyi. Çocuk kulübü harika özellikle aktivitelerden sorumlu Sevilay hanım çok ilgiliydi. Eylence ekibi muhteşem özellikle Yiğit bey harika.",
    "mainClasses": [
      "Service"
    ],
    "subClasses": [
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Joy"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_28",
    "rating": 4,
    "date": "2025-10-06",
    "location": null,
    "country": "Unknown",
    "comment": "Kid club was good, rooms were clean. Most of the staff try to avoid you especially in the morning. Food was good but meat was not delicious. They do not care how many times you have visited them, you are always seen as an ordinary customer.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Service"
    ],
    "subClasses": [
      "Accessibility",
      "Entertainment",
      "Quality",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_29",
    "rating": 2,
    "date": "2025-10-05",
    "location": null,
    "country": "Unknown",
    "comment": "Our review on Titanic Deluxe Lara as a family of 2 adults 1 child 8yrs\nArrival - no welcome drink, luggage porter or assistance to room Room- good size we stayed in a family room sea view. Room was surface clean but we had to wipe down sides and bathroom again so bring antibacterial wipes. Toiletries, towels provided and changed daily. Mini bar included complimentary. Tea/coffee and kettle in room. Good size tv that you can connect firestick too so bring with you as no English channels. No iron in room and not allowed in rooms (hotel policy). Air con works well. No USB charging and only 3 sockets so bring extension lead and adaptors. Cushions and bed aren't very comfy but good size. Food- our main issue with the hotel. Food is the same every day. Food doesn't cater well to English and is very very meat heavy. Labels on Food are hit and miss and you would really struggle here with any food allergy as cross contamination and labelling is incorrect. Food always lukewarm and not rotated or managed. Nothing is cooked in front of you or too your taste. Most dishes are stew based or boiled sitting in water. We really struggled to feed our son anything whilst we were here apart from waffles and pancakes. Cats roam around restaurant and tables aren't sanitised when reset with dirty cutlery. So again bring wipes to clean your table down before eating. No sanitizer station in restaurants. Drinks are served too you at table and can take a while to be served. Al a carte serve exactly the same food that can be found in buffet restaurant. Service is better in al a carte but not worth the extra cost. Flies everywhere in restaurants. Pastry chef - nothing is cooked fresh . All pastry and cakes come in either frozen or batch baked from boxes. Only reheated or plated up here. Drinks- absolutely awful cocktails. Spirits are branded and served free hand. Efes is main beer served but if you ask at bars you can get Corona, Becks and Miller. Soft drinks are from a mixer machine that is very watery or poured out flat from 2ltr bottles. You can ask for crisps and nuts at bars. They seem to hide drinks from you and push cheaper local drinks. Coffee hut open until midday is slightly better as have full options of alternate milks and syrups. Pools- slides and kids water tower are really good. However again cleanliness around the pools is shocking. Smell of sewage especially around childrens pool and toilets are horrendous. You are provided with key cards to get fresh towels for pools each day. Beds are really comfy. Pools aren't heated apart from indoor pool. We always managed to get a bed. Drinks can be ordered to your bed via qr code. Pools sides are very slippy. We witnessed adults and children falling over. Definitely recommend swim shoes for children. Cabanas- we hired a pier cabana and really enjoyed our day. They start at €150 euros -€300 depending on location . Service from our butler was really good. Food served is the same you get from the beach side restaurants. Kids club- recently refurbished and very good facilities including a soft play, lego room, ps5 and craft room. Air con and option to stay with child or leave with wristband. Activites throughout the day and open until midnight. Kids club restaurant has small menu, ice cream, baby food and milkshakes. Beach- lovely beach with plenty of beds and a beach bar. About a 5 min walk from main complex. Not enough options in the evening for family mainly djs or loud bands. Noise may be a problem if you want to have an early night. Hotel opposite (i think miracle hotel?)had loud music until 2am . We was up late most nights so not an issue for us. Staff- all staff are polite but do tend to serve locals before you. Location- we had private transfer and took 20 minutes from airport. Right in middle of lara beach \nYou can walk into main strip in 5 minutes over the blue bridge . They accept euros , sterling and lira in shops. Facilities- hotel is over 20 years old and it does show in alot of areas. Furniture and seating well worn, decor very dated and generally dirty in need of a deep clean. The hotel has a spa and gym. Both facilities really good and look recently upgraded. Gym has air-conditioning and a good selection of free weighs and machines. Bowling bar has a bowling alley that has to be prebooked day before and pool tables. Bowling alley has no option for side barriers or ramps to help children play. Arcade room over half of the games are broken which is frustrating. Gardens are well maintained and lovely to walk around. There is not enough lifts for hotel guests and queues are frustrating especially with guests pushing in front. In hotel shops are ridiculously overpriced. Cats- cats are everywhere and freely roam around hotel and restaurants. Not something we liked or agreed with . Tripadvisor- before booking this hotel we could only see glowing reviews and what we have experienced is in no comparison at all to what we were expecting. Negative reviews are blocked or taken down. We have been asked to leave a positive review but we will be leaving a real review on TripAdvisor but imagine it won't get published. This hotel is not value for money and very overpriced. Atm we havent (touch wood) been ill but we have seen rooms being closed off and housekeeping leaving changes of laundry and towels at bedroom doors to unwell guests. And the hospital doctor is always on call visiting\nguests in rooms. We have spoke to families who have colds (believe to be from air con units/pool bacteria? ) and overheard many families mentioning stomach issues. We would say this is a 3 star hotel no deluxe aspect that we experienced. Hotel is very dated in places, food is poor, cleanliness is shocking and overall experience is just ok. We have visited Turkey many times and this has been the most disappointing hotel. Our best day was out of the park at Land of Legends. We would not return and would not recommend.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Bar",
      "Beach",
      "Bed",
      "Breakfast",
      "Cleanliness",
      "Entertainment",
      "Gym",
      "Neighborhood",
      "Noise",
      "Overall Value",
      "Parking",
      "Pool",
      "Price",
      "Proximity to Attractions",
      "Quality",
      "Restaurant",
      "Room Service",
      "Spa",
      "Staff Attitude",
      "View"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Anger",
      "Annoyance",
      "Approval",
      "Disappointment",
      "Disapproval",
      "Disgust",
      "Joy",
      "Neutral",
      "Sadness",
      "Surprise"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_30",
    "rating": 5,
    "date": "2025-10-05",
    "location": null,
    "country": "Unknown",
    "comment": "Also Merve von gästebetteung war jederzeit bei uns und jederzeit behilflich in allen Hinsichten,,, ich sage nur danke Merve es war toll und danke nochmals für alles ,,,, daher kann ich euch und Titanic nur weiterempfehlen",
    "mainClasses": [
      "Service"
    ],
    "subClasses": [
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Gratitude"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_31",
    "rating": 4,
    "date": "2025-10-04",
    "location": "Fife, United Kingdom",
    "country": "United Kingdom",
    "comment": "Just home after 2 weeks at this hotel with family and we had a brilliant time! I have provided my honest review below… This hotel should not be advertised as 5 star. A 4 star would be fair as there is room for improvements. A bit tired, in need of refurbishment. We were on the 8th floor and the furniture is a bit worn and showing signs of wear/ looks like they haven’t had anything done to them in recent years. Paint around windows and walls cracking. The shower is a good size and there was always hot water. Also glass windows to the front of the hotel are shattered half way up the building. Carpet in hallways stained. Plenty of choice in the main buffet restaurant, snack bars at lunchtime were very good. Kebabs at one and pizza and pasta at the other. We went here everyday to break up always going to the main restaurant so we didn’t get bored. Good choice of drinks, providing cans of soft drinks around the hotel and not just in the mini bar would be a good improvement. A lot of good branded drinks and beers served in bottles. Always something on to keep them entertained and felt very secure with the wristband process. We were very impressed with the kids club and the kids in our party loved it. Illness stories are true: To clear up all the feedback of people saying they were getting ill while staying here, we found this to be true. 4 of our party all had symptoms of a sickness bug - high fever, sickness, diarrhoea. Not just a bit of a bad belly this was full on sickness and a high fever with loss of appetite following it. This lasted a full day or 2 days max for each of us. I guess it’s a mix of people having a bug and spreading it through hygiene, hand sanitising stations dotted around the site would help with it being such a large hotel. Something we found annoying was one day half way through our holiday a member of staff came to us at the pool and tried to pressure us into submitting a review on trip advisor and google there and then. I don’t review until the end of my stay to give an accurate and fair feedback on my visit so this was very unprofessional and annoying. A special mention to the rollerblade guy at the Olympic pool mete I think his name was, served us well everyday and was very pleasant and hard working. Also the lady on the pool towel desk she was so friendly and cheery everyday when we met her. She made us smile every morning! All in all we had a good holiday with family but I would definitely say it is fair to say that this hotel is not 5 star and should not be advertising itself as it is until some well needed improvements are made. The price we paid per person £2k for 14 nights I feel was well over what it was worth.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Entertainment",
      "Neighborhood",
      "Overall Value",
      "Pool",
      "Price",
      "Proximity to Attractions",
      "Restaurant",
      "Room Service",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Annoyance",
      "Approval",
      "Disapproval",
      "Joy",
      "Neutral",
      "Sadness"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_32",
    "rating": 5,
    "date": "2025-10-04",
    "location": "Fareham, United Kingdom",
    "country": "United Kingdom",
    "comment": "This hotel too good why everything and everyone so perfect🤩🤩🤩🤩 kids club fantastic and entertainment amazing.",
    "mainClasses": [
      "Amenities"
    ],
    "subClasses": [
      "Entertainment"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_33",
    "rating": 5,
    "date": "2025-10-04",
    "location": null,
    "country": "Unknown",
    "comment": "Mustafa the roller man at the kids pool is very pleasant and cant do enough for you. Thank you so much for all his efforts.",
    "mainClasses": [
      "Amenities",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_34",
    "rating": 5,
    "date": "2025-10-04",
    "location": null,
    "country": "Unknown",
    "comment": "5 adults (1 was 18) and 2 kids. I am keeping this short and sweet 🤣\nHotel is stunning\nStaff fabulous \nFood was fantastic (something for everyone) I literally tasted a little bit of most things and loved it! Pools, what a selection! Drinks brilliant variety and branded!(I only had 1 alcoholic one the rest was the homemade lemonade 🍋🤤)\nKids club, unbelievable (my kids were 5 and 3)\nLifts can be a bit annoying but it's the people that queue jump is the problem too!! Only thing I have to add that isn't a big thing is please fix the indoor jacuzzi's as they werent great, and maybe the pool inside a tiny bit warmer 🤣🤣 oh and the coffee bar might need to open for a bit longer 😉. Otherwise thank you all so much for an incredible stay and see you all in July ❤️",
    "mainClasses": [
      "Amenities",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value",
      "Pool",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_35",
    "rating": 5,
    "date": "2025-10-04",
    "location": "Dundee, United Kingdom",
    "country": "United Kingdom",
    "comment": "Seyit was very friendly and attentive and helpful thank you for everything especially for caring 🤩🤩🤩💙💙💙💙💙💙💙",
    "mainClasses": [
      "Service"
    ],
    "subClasses": [
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Gratitude"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_36",
    "rating": 4,
    "date": "2025-10-04",
    "location": null,
    "country": "Unknown",
    "comment": "Just spent a week at the Titanic Lara, brilliant experience for the kids and staff have all been very good. Seyit the pool lifeguard works very herd watching the kids around the pool area. The only bad thing is the pool area is very slippy and he spends a lot of time attending to children’s first aid needs. He is very attentive and follows safety measures brilliantly. I think the hotel should invest in non slip mats around the pool as everyone falls, even the staff. Kids have loved the kids club, everything is free including t shirt painting and  printing of any photos of their choice. Food is very good, the only small negative would be more choice of kids lunches around the snack bars, such as plain chip, smaller pizzas etc. the kids club have an eating area but they don’t allow you to take food away. Just a small thing which didn’t affect our stay. Had a brilliant week and would return.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Entertainment",
      "Overall Value",
      "Pool",
      "Quality",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Love",
      "Neutral",
      "Optimism"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_37",
    "rating": 5,
    "date": "2025-10-03",
    "location": null,
    "country": "Unknown",
    "comment": "Good food, Kids club is insanely good! Emre in Guest relations was amazing!! and rollerblading Mustafa is so friendly and attentive. Would come back time and time again.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value",
      "Quality",
      "Room Service"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_38",
    "rating": 5,
    "date": "2025-10-02",
    "location": "Berlin, Germany",
    "country": "Germany",
    "comment": "Die Zimmer sind sehr geräumig, und der Service sowie das Personal sind hervorragend. Ein besonderes Dankeschön an Emre aus der Gästebetreuung, der sich besonders liebevoll um uns gekümmert hat.",
    "mainClasses": [
      "Room",
      "Service"
    ],
    "subClasses": [
      "Cleanliness",
      "Housekeeping"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude"
    ],
    "sentiment": "Positive",
    "category": "Room"
  },
  {
    "id": "review_39",
    "rating": 5,
    "date": "2025-10-01",
    "location": null,
    "country": "Unknown",
    "comment": "We had a great stay, we couldn't fault a thing. We had our daughter with us and the kids club has the best facilities we have seen in a hotel. Staff, good cleanliness were all great.",
    "mainClasses": [
      "Amenities",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_40",
    "rating": 5,
    "date": "2025-10-01",
    "location": "Liverpool, United Kingdom",
    "country": "United Kingdom",
    "comment": "Brilliant hotel, staff fantastic and great options for food and facilities. Came as a family of 3 with a 3yo and we all had a brilliant time.",
    "mainClasses": [
      "Service",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_41",
    "rating": 5,
    "date": "2025-10-01",
    "location": null,
    "country": "Unknown",
    "comment": "Great atmosphere, lovely staff. Clean rooms and pool, staff are beyond friendly and provide anything you need. Kids club is the best I’ve ever experienced.",
    "mainClasses": [
      "Amenities",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Pool",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_42",
    "rating": 5,
    "date": "2025-10-01",
    "location": null,
    "country": "Unknown",
    "comment": "It’s our third vacation at titanic deluxe Lara and we always love to come back here. Especially the service is outstanding. We enjoy our days at the Olympia pool and our rollerblade bartender “Yusuf”& “Mete” are super kind and always helpful. Also the bartender behind the bar “Zeliha”, “Demet” and “Ayşe” are super sweet and generous. Another great staff I like to highlight is our towel lady “Ayşe” thank you so much for everything. We definitely come back next year.",
    "mainClasses": [
      "Amenities",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value",
      "Pool",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude",
      "Joy",
      "Love",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_43",
    "rating": 5,
    "date": "2025-10-01",
    "location": "Blackpool, United Kingdom",
    "country": "United Kingdom",
    "comment": "Excellent food, friendly helpful staff, clean spacious rooms. Kids club is amazing for our 2 year old boy, would definitely return. Special mention for the rollerblading waiter Mustafa who works so hard and is so friendly. Lovely hotel and thank you :)",
    "mainClasses": [
      "Amenities",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_44",
    "rating": 5,
    "date": "2025-09-30",
    "location": null,
    "country": "Unknown",
    "comment": "We been here 2 years and this year also choose this hotel. Rooms are got better cause carpets gone now fresh and clean. Generally place is changed and bigger now. Restaurants really nice ans clean the food is perfect.",
    "mainClasses": [
      "Food",
      "Location",
      "Room"
    ],
    "subClasses": [
      "Accessibility",
      "Cleanliness",
      "Restaurant"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Food"
  },
  {
    "id": "review_45",
    "rating": 5,
    "date": "2025-09-30",
    "location": null,
    "country": "Unknown",
    "comment": "Konum hizmet odalar yemek çok iyi..Çık memnun kaldım..Tekrar geleceğim bir otel kesinlikle..Çalışanlar güleryüzlü..",
    "mainClasses": [
      "Amenities"
    ],
    "subClasses": [
      "Entertainment"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Joy"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_46",
    "rating": 5,
    "date": "2025-09-30",
    "location": null,
    "country": "Unknown",
    "comment": "This is my 3rd day so far on holiday with my partner and little boy and so far it has been very nice experience with friendly staff and very entertaining. Loving it so far Service\nSuch nice food aswell and very clean",
    "mainClasses": [
      "Service"
    ],
    "subClasses": [
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Joy"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_47",
    "rating": 4,
    "date": "2025-09-29",
    "location": "Plymouth, United Kingdom",
    "country": "United Kingdom",
    "comment": "We have just returned from 10 days at this hotel there are some minor improvements that need to be made but on the whole we have had a great holiday. Pools - good variety and lots of space as long as you arent bothered about being right on pool side at the main pool. All pools are cold but bearable (we normally travel out of season so are used to having pools heated). The main downside is the lack of shade, we have a 3 year old and the only way we could guarentee shade without having to sit on a grassy area or having to move constantly was to pay for a cabanna. I appriciate the sun moves but I have never known it to be so difficult to maintain shade even with umbrellas. Unfortunately every so often there is a sweage smell near the main pool - very noticeable next to the bar in the shaded free cabannas on the grass which I refer to above. Paid Cabannas - these were a life saver despite me having to pay for them. We did a beach cabanna twice (front row) and pool cabanna four times. The service we recieved from the guys here was really good special mention to Aziz and Ahmet, we also had one other guy who was great but unfortunately I didnt get his name. The pool cabannas are in need of a repaint as the paint is coming off and ends up on your feet. The other thing is they are only surface cleaned we quite often noticed old empty bottles, dropped food etc under the cabannas or stickers from peoples googles left on the side. Although I am a firm believer people should clean up after themselves for the amount you pay (150euro a day) they should be cleaning these properly. The only thing I would say is more needs to be done to keep people out of the area who have not paid as unfortunately people ignore the red barriers and peoples kids seem to do as they please (appriciate this isnt down to the hotel so much but more measures to help you enjoy the cabanna without worrying about other people invading your space and then arguing when you politing ask them to leave would be helpful). I also think you should have 2 teirs of pricing to allow a cheaper option with no butler service but still use of the cabannas. Rooms - Very small for a family of 3 compared to other hotels we have been too. We really struggled getting the pram in the room and it not being in the way of a bed or the exit. Beds and pillows were uncomfortable but this is a personal preference we managed to sleep just not as well as I would have liked. Again cleanliness is surface clean my daughters feet were black from walking around the room and balcony both day one when we got here, throughout and including our final day. This again is not expected from a 5 star hotel. Drinks were always topped up well. There is also signs of wear in the room, balcony door doesnt properly lock, cracked handle for bidet, dirty curtains, peeling wallpaper. View was quite nice could see other hotels entertainment plus sea, pools, moutains and we would often watch the planes at night. Food - Buffet is plentiful for variety and hot, always staple beige food avaliable. Alot of the meat is overcooked for our taste and the food seems to be the same options daily. We did have the Asia al a carte booked but this was cancelled due to lack of other people who had booked and we also booked the steak restaurant. We very much enjoyed our t-bone steaks our only comment was it needed to be seasoned which of course we did do ourselves but would have expected it to come seasoned to taste. The beach restaurants at lunch were by far our favourite but food is very much pizza, pasta, burger and kebabs. Personally we would prefer the option of more traditional local food options avaliable. Facilities- Bowling we didnt use as the age limit was alot higher than our daughters age. Arcade is pointless as 90% of the rides/games are out of order. I would much rather have to pay for each game/ride and them all be working and maintained, than it be a free arcade and nothing works. Entertainment looked good from the snippets we saw as it was abit loud for our 3 year old. Titanic fest was really nicely catered to for kids with lots of games and inflatables. I cannot comment on the spa or gym as we didnt use it. The Hookah store is lovely and if you like your shisha the home made stuff she offers is very nice and good value. The kids club has alot of options for kids the only thing i would say is they aren't good at giving blank colouring sheets, my daughter wanted to colour a number of times and we never ended up getting a new picture for her as even when asking the staff didn't give us any and couldn't find any lying around. There is some signs of wear on some of the toys or pieces missing but this isnt unexpected. Beach - clean, safe, lots of fish. We fed the fish biscuits and watermelon from the peir a few times. Sand gets hot so recommend water shoes. Defo get a beach cabanna on front row for guarenteeed shade. Staff - all staff friendly and polite and speak good variety of languages. Life guards also really friendly and observant. Any staff selling spa treatments, cabannas, Al a cartes and even entertainment team are very respectful of a no thank you and are not in anyway pushy with getting you to spend more which is refreshing for Turkey. Lifts - absolute pain point 5 lifts for this size hotel is horrendous as they are shaped as they would be on a cruise ship (to fit the theme) they barely fit anyone in especially when cases, prams and/or inflatables are involved. Breakfast, evening after the pool (around 5/6pm) and dinner were the worst sometimes having to call the lift in excess of 10 times before we could get in. Location - close to shops, dolphinarium and bars/restaurants also on 25mins drive from Land of legends and 30mins from airport. On the whole I would recommend this hotel it does need a couple of minor improvements to reach the 5 star standard advertised and expected for the cost but it didnt particularly dampen our experience.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Bathroom",
      "Beach",
      "Breakfast",
      "Cleanliness",
      "Entertainment",
      "Neighborhood",
      "Noise",
      "Overall Value",
      "Parking",
      "Pool",
      "Price",
      "Proximity to Attractions",
      "Quality",
      "Restaurant",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Approval",
      "Disapproval",
      "Disgust",
      "Joy",
      "Love",
      "Neutral",
      "Realization",
      "Sadness"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_48",
    "rating": 5,
    "date": "2025-09-29",
    "location": null,
    "country": "Unknown",
    "comment": "Amazing holiday, best hotel ever thanks everyone for making our trip better and better. And special thanks Ergin from guest relations",
    "mainClasses": [
      "Service",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Gratitude"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_49",
    "rating": 3,
    "date": "2025-09-29",
    "location": "United Kingdom",
    "country": "United Kingdom",
    "comment": "Bad check in experience. The evening front desk manager was very poor and abrupt. We were put in an annex then a room at the back of the hotel with no view. Despite showing the TUI app saying all their rooms have a partial sea view. His answer was ‘see your rep tomorrow’. The next day was very different, when rep spoke to front desk they were happy to move us. Food is quite boring with not much imagination, the al a carte’s are all extra and not worth the money. We went to the Asian which was nice but not worth the €20 each when you are already all inclusive. Staff are miserable with most not smiling or greeting you. Ordering drinks at the bar they don’t even make eye contact when handing the drinks over. Service in restaurants very slow and rude. You have to wave to get attention for someone to finally turn up to your table to take a drinks order. The exception are the guys getting drinks round the pool, they are great. The hotel have fixed brolleys round the pools which means you can’t always get shade or sun on beds as required. Rooms are clean and functional. Air con not very effective so in height of summer may be an issue. The evening entertainment starts at 21.45 which is a bit late. The compères are terrible - I’ve seen more life and motivation in a dead cat. I’ve stayed in better, and worse, hotels in Turkey. Don’t think the ‘delux’ name is warranted.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Cleanliness",
      "Entertainment",
      "Front Desk",
      "Noise",
      "Overall Value",
      "Pool",
      "Proximity to Attractions",
      "Restaurant",
      "Room Service",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Annoyance",
      "Disappointment",
      "Disapproval",
      "Fear",
      "Joy",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_50",
    "rating": 5,
    "date": "2025-09-28",
    "location": null,
    "country": "Unknown",
    "comment": "Super hotel\nSuper staff \nSuper cabana services with Dilaver\nAmazing guest relations Merve\nMerve so pretty nice cute friendly I love her so much",
    "mainClasses": [
      "Service"
    ],
    "subClasses": [
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_51",
    "rating": 5,
    "date": "2025-09-27",
    "location": null,
    "country": "Unknown",
    "comment": "Excellent hotel first time here will come again entertainment very good food good staff good pools good kids club good everything good 👍",
    "mainClasses": [
      "Amenities"
    ],
    "subClasses": [
      "Entertainment"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_52",
    "rating": 5,
    "date": "2025-09-27",
    "location": null,
    "country": "Unknown",
    "comment": "Mustafa and Eyüp have been brilliant ont heir rollerblades very helpful fast and efficient very happy. Our two children had an amazing experience at the kids club also very safe and so much fun for them to have couple hours out of the sun. The food is also amazing so much variety and very tasty. All staff are so friendly and  welcoming",
    "mainClasses": [
      "Amenities",
      "Food",
      "Service"
    ],
    "subClasses": [
      "Entertainment",
      "Quality",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Joy"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_53",
    "rating": 5,
    "date": "2025-09-27",
    "location": "Troon, United Kingdom",
    "country": "United Kingdom",
    "comment": "We had the absolute pleasure of meeting Seyit, the lifeguard at our hotel, and he is truly outstanding at his job. From the moment we arrived, he has been incredibly friendly, approachable, and always willing to go the extra mile to make sure everyone feels safe and comfortable. He is amazing with children—patient, kind, and engaging, which instantly put us at ease as parents. When my son slipped and bumped his head, Seyit was at the scene within seconds. He was calm, attentive, and professional, handling the situation with such care and reassurance that we knew we were in excellent hands. What really stands out about Seyit is not just his skill as a lifeguard, but also his genuine warmth and accommodating nature. He takes time to check in with guests, makes sure everyone is enjoying themselves safely, and has a natural way of making people feel looked after. It’s rare to meet someone who combines expertise with such kindness. Seyit is a credit to the hotel—our family will always remember his exceptional service and positive energy. We can’t thank him enough and highly recommend him to anyone visiting here. Eyüp, the rollerblade drinks waiter, is absolutely exceptional. He brings such a vibrant energy to the pool area and makes the whole experience feel special. Watching him gracefully glide from lounger to lounger while making sure everyone is looked after is honestly amazing. He is incredibly professional and attentive—always noticing when guests might need a refresh and arriving with a smile before you’ve even thought to ask. He remembers details, makes sure everything is just right, and nothing is ever too much trouble for him. That level of care really sets him apart. Beyond his skill and efficiency, it’s his personality that makes the difference. Friendly, approachable, and genuinely kind, he makes every interaction a pleasure. You can tell he truly takes pride in his work, and it shows in the way he goes above and beyond for every guest. Eyüp is an absolute credit to the hotel. His dedication, charm, and outstanding service turned our time by the pool into one of the highlights of our holiday. Staff like him make all the difference between a good trip and a truly memorable one.",
    "mainClasses": [
      "Amenities",
      "Location",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Neighborhood",
      "Overall Value",
      "Pool",
      "Proximity to Attractions",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Approval",
      "Caring",
      "Gratitude",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_54",
    "rating": 5,
    "date": "2025-09-26",
    "location": null,
    "country": "Unknown",
    "comment": "Beyond perfect, cannot fault anything about the hotel from start to finish. They have gone above and beyond in every aspect. Our daughters bday whilst here and she got treated like a princess. The kids club is beyond perfect.so friendly and professional. The activities they do are beyond anything I've ever seen in any hotel before. My daughters 1st time in a kids club and she came every day for a few hours. I would rate it over a 5* hotel we cannot wait to come back again",
    "mainClasses": [
      "Amenities",
      "Location",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value",
      "Proximity to Attractions"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral",
      "Surprise"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_55",
    "rating": 5,
    "date": "2025-09-26",
    "location": null,
    "country": "Unknown",
    "comment": "Amazing amazong amazong entertainment was graat Partys dance showses and Sport activities really good and Animation Team yigit a Real man and energetic and fun really crazy Showmaster tank you",
    "mainClasses": [
      "Amenities"
    ],
    "subClasses": [
      "Entertainment"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_56",
    "rating": 5,
    "date": "2025-09-24",
    "location": "Aberdeen, United Kingdom",
    "country": "United Kingdom",
    "comment": "Friendly staff… hotel is amazing.. entertainment at night is ace also and great for family’s..",
    "mainClasses": [
      "Amenities",
      "Service"
    ],
    "subClasses": [
      "Entertainment",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_57",
    "rating": 2,
    "date": "2025-09-24",
    "location": null,
    "country": "Unknown",
    "comment": "Myself and my family was having a pleasant trip until we try to buy something in the store on the premises everything is 10 times the price on the resort they say this is a five-star hotel I would give it a 3 at best the staff don't care once they have your money it's a shame me and my family travel all over the world and this is probably one of the worst hotels we've been the photos look beautiful the only consolation the food was decent there are many hotels near here that are much better that live up to the five star review",
    "mainClasses": [
      "Food"
    ],
    "subClasses": [
      "Restaurant"
    ],
    "sentiments": [
      "Negative"
    ],
    "emotions": [
      "Disappointment"
    ],
    "sentiment": "Negative",
    "category": "Food"
  },
  {
    "id": "review_58",
    "rating": 3,
    "date": "2025-09-24",
    "location": "Whitby, United Kingdom",
    "country": "United Kingdom",
    "comment": "For this been a 5 star it’s probably the worst one we have been too and we have been to many in Turkey and Lara. The hotel itself is beautiful and the staff are lovely friendly. The room was TINY for a family of 4 it was unbearable at times. The drains stank and the bedding was wet. The main pool was heated luckily but the kids pool is shocking it’s freezing!!! Indoor pools none of are heated either. The food is a disgrace it’s the same every single day and if your a vegetarian you will struggle here. It’s very meat heavy. No chance of getting a drink with your meal and if you do they don’t understand what you want unless it’s coke!!! The lunch time for me with the kids was a shame as no poolside snack bars you have to go sit down and order from the bars near the beach. Jack potatoes don’t serve till 4pm. Other than that it’s cakes ice cream and waffles. The Sunbed drama every single day WOW!! Never have I ever been in a hotel like it.! This needs sorting asap it’s a joke. For families with kids you have to be up at 6 to put towels down to be able to even see the kids in the pool . Yet people putting towels down and leaving them all day JOKE \nDONT EVEN START ME ON THE LIFT!!!! you need to put a staff member on the lower levels to stop people pushing in it’s disgraceful the arrogance of some people. This hotel was so noisy!!! The music is thumping until the early hours none of us slept then your up at crack of dawn for a sunbed. To say this was a holiday it was awful. Never ever again would I come here and for the price it’s a actual robbery",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service"
    ],
    "subClasses": [
      "Bar",
      "Breakfast",
      "Entertainment",
      "Neighborhood",
      "Noise",
      "Pool",
      "Proximity to Attractions",
      "Quality",
      "Restaurant",
      "Room Service",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Amusement",
      "Annoyance",
      "Disappointment",
      "Disgust",
      "Excitement",
      "Neutral",
      "Surprise"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_59",
    "rating": 3,
    "date": "2025-09-24",
    "location": "United Kingdom",
    "country": "United Kingdom",
    "comment": "I just wanted to write an honest review for anyone looking to book here next Summer The Good\nSwift check in and luggage delivered to room on arrival - no welcome drinks available which have experienced in other 5 star hotels. The majority of the food was really good and tasty. The pools are clean and big, plenty of really good slides for children of all ages and adults. The drinks are good. Cocktails all made with branded spirits. Plenty of bottled water available all over the complex. Clean pool towels available all day. Change as many times as you like. Plenty of daily activities, darts, yoga, pool games etc if you’re into that kind of thing. Entertainment at night was good. Different shows in the amphitheater most evenings or party’s - white party, pier party also a titanic fest one evening on the football field which was full of interactive inflatables, food and even a buckeroo! The kids club is huge and did look really good it also has a little restaurant and menu just for kids. Find the ice lolly’s in here - although I did not feel comfortable leaving my 5 year old in there by himself, I just didn’t get a good vibe that he would be 100% safe in there. Especially on an evening the automatic front doors were constantly opening as it was so busy with people coming in and out. So easy for a child to escape in my opinion. The cabana’s - we hired a pool cabana on two occasions on our 10 day trip. Although these are pricy at €150 for six people (extra per person for any more) - the service was outstanding and really enjoyed the space in the cabanas. The staff - they all work so hard, majority of them very friendly and cannot do enough for you. Special occasions- we had a birthday. The staff went above and beyond for this. Decorated room, our cabana had baloons and also our meal at the steak house also had baloons. We had wine fruit a birthdays card and a cake in our room. The weather was amazing! Late 30s early 40s each day. The Bad\nThe rooms - these are very small and cramped, furniture and decoration rather outdated, the bedding seemed damp on most days which was weird. The duvet was too small. For what we paid it was definitely not justified here. The lifts - these are an actual joke especially at busy times. We gave up on these a fair few times and took the stairs. Luckily we was on floor 3. The food / dining experience - although food very tasty it was the same thing each day. I found myself at the Indian/ Chinese/chip section most evenings. You cannot get a drink yourself. You have to wait for the staff to come and serve you. Not good when you are parched. Also having to sit at a dirty table most nights to wait for it to be reset. The complex overall is very cramped. There are a lot of people and it feels really crowded where ever you go. This was disappointing as they looked good on the pictures. The iced drinks are literally very watery iced coffee with squirts of syrup chucked in for the flavour. Ants - don’t use the subbed on the grass unless you like being bit to death by the ants!! The lunch restaurants - again good food but very long waits Snacks - not a massive selection of snacks through the day. I mean there’s only so many cakes, jacket potatoes, or waffles you can eat  no fast food huts like experienced at other 5 star hotels. The ugly\nSun beds!!! The sunbed situation is terrible. Don’t get me wrong there is always beds available somewhere on that complex but not always where you would prefer. But don’t even bother with the ones by the main pool unless you want to become involved in heated arguments almost fights with other guests who think you have stolen their beds! People get up silly hours to reserve the beds with their towels in the best locations round the main pool and then leave them and go back to bed. However little do they know guest relations comes along and remove these towels, then along come innocent people and think oh great I’ve got a decent bed, to be greeted by horrible angry guests a few hours later claiming you have stolen their beds and towels. So there you go hope this helps you in deciding where to spend your hard earned money on your well earned family holiday",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Bed",
      "Cleanliness",
      "Entertainment",
      "Fees",
      "Gym",
      "Housekeeping",
      "Overall Value",
      "Pool",
      "Proximity to Attractions",
      "Quality",
      "Restaurant",
      "Staff Attitude",
      "View"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Amusement",
      "Desire",
      "Disappointment",
      "Disapproval",
      "Disgust",
      "Fear",
      "Joy",
      "Neutral",
      "Optimism"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_60",
    "rating": 3,
    "date": "2025-09-23",
    "location": null,
    "country": "Unknown",
    "comment": "We travelled as a large family group in July 2025 and were initially impressed by the grand lobby, attractive grounds and multiple pools. The beach area is lovely and there’s plenty of food variety at first glance. Unfortunately, several of us became unwell during and after the stay, with one confirmed case of salmonella and others suffering stomach cramps and vomiting. We also witnessed other guests being sick around the resort and even saw a child soil the pool—only half the pool was briefly closed, which was worrying. Our room was clean but noticeably small for a 5-star resort, leaving little space for luggage and making it feel cramped, especially with children. Service was mixed: staff were generally polite, but when we requested fresh bedding after our daughter was ill, it took a long time for housekeeping to respond. After sleepless nights caring for our poorly children, we didn’t feel like we had a holiday at all. The setting and facilities are attractive, but hygiene, food safety, and room size need serious improvement. Until these issues are addressed, I can’t recommend this hotel despite its 5-star appearance.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Cleanliness",
      "Overall Value",
      "Pool",
      "Proximity to Attractions",
      "Quality",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Disapproval",
      "Neutral",
      "Sadness"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_61",
    "rating": 3,
    "date": "2025-09-23",
    "location": "London, United Kingdom",
    "country": "United Kingdom",
    "comment": "The Titanic Deluxe Lara has some positives, but in my view the negatives outweighed the good. On the positive side, around 80 percent of the staff are excellent. They are friendly, polite, and genuinely eager to help. The food is also very good, with plenty of variety and consistently good quality. Unfortunately, the overall experience does not feel like true five-star luxury, especially when compared with other hotels in Turkey. Rooms are smaller than expected, and even basic items like an iron and ironing board required repeated requests at reception. Service, although well-meaning, is slow. Waiting 20 minutes for drinks at the bar was not unusual, and cocktails were inconsistent. Communication can also be difficult at times because of language barriers. Several aspects were disruptive or unnecessary. Many mornings we were woken by staff loudly restocking minibars along the corridor. On the night before departure we were told to settle our bill by 8pm and even received a reminder phone call, which felt pushy. The hotel is clean overall, but the sunbeds and some communal areas are starting to show their age. The whole property feels a little tired compared with more modern resorts in the area. I may sound critical, but I have stayed in many excellent hotels across Turkey, and this one does not compare well with its competitors. I would urge travellers looking for a true luxury experience to consider newer hotels in the Lara region where real five-star service and facilities are on offer.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Neighborhood",
      "Noise",
      "Overall Value",
      "Proximity to Attractions",
      "Quality",
      "Room Service",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Desire",
      "Disappointment",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_62",
    "rating": 3,
    "date": "2025-09-22",
    "location": "London, United Kingdom",
    "country": "United Kingdom",
    "comment": "Before we arrived, my husband requested a free room upgrade and we did receive one, which was a nice touch. The room had two large beds — I coslept with my baby in one while my husband slept in the other. A cot was also provided. On arrival, the room had been decorated with wine, a swan towel, and flower petals, which was sweet. Unfortunately, the positives ended there. The cleanliness was very poor. On the first night, we were too tired to complain, but the floor was filthy (my daughter’s feet turned black from walking on it) and the bathroom had hair all over the floor and walls. The next morning, we requested a deep clean. Even after this, hairs and dirt were still left behind, and we had to complain again before it was done properly. The room itself felt run down and definitely didn’t match a true 5-star standard — a renovation is much needed. Food & Service:\nThe food was generally nice, with highlights being the pizzas, kebabs (though they ran out quickly), and desserts. However, service was inconsistent and often disappointing. Staff frequently ignored us when we asked for drinks. We drink a lot of water, and while some staff provided large bottles, others refused, insisting they could only give small bottles or cups. Tables and cutlery at the buffet were almost always dirty, and drinks from machines tasted watery or overly syrupy — only cans and alcohol (which we don’t drink) seemed decent. Pool & Entertainment:\nThe pool area smelled like sewage for three days, which was very off-putting. It also wasn’t cleaned as often as it should have been. Sunbeds were impossible to get unless you reserved one around 6–7am. Entertainment, however, was a highlight — fun activities during the day and enjoyable shows at night. Kids Club:\nThe kids club itself is excellent in terms of facilities. There’s so much for children to do, including a sleeping room and even a little restaurant just for them. Children are given wristbands and staff take parents’ phone numbers so they can contact you if needed. Many parents felt comfortable leaving their children there with staff, which is allowed. However, supervision is not always reliable. On multiple occasions, I saw children left completely unattended when a staff member walked out of the room — sometimes leaving the door open. While the wider facilities are secure, this could still allow a child to wander out or, worse, make it possible for someone to walk in and take a child without staff even realising. This is a serious safety issue, and more staff and stricter supervision are urgently needed. Illness & Hygiene Issues:\nFrom 11th September, my 1.5-year-old daughter became ill with vomiting. By the 13th, both my husband and I were also sick, experiencing vomiting, fever, diarrhoea, and muscle aches. At one point I was bedridden. Despite asking for our room to be disinfected after these incidents, vomit stains were still left on the walls and no proper sanitisation was done. The hotel doctor cost €150 and could only refer guests to the hospital, so it didn’t feel worthwhile. When we complained, management dismissed our illness as an “isolated issue” and insisted their hygiene standards were high, which is simply untrue. Cutlery, cups, and tables at the buffet were often dirty, public toilets were unclean, and food hygiene was questionable (I was served undercooked chicken once, and buffet cheese sat out in the heat). Staff also did not stop other guests from touching food with their hands. After posting on a Facebook group, I discovered that many other guests had also been sick around the same time — so this was far from an isolated case. Extra Costs:\nFor a hotel already charging premium prices, extras are very expensive. Cabanas cost €150 per day, and the spa starts at €100 minimum, which feels excessive given how much guests already pay to stay here. Final Impressions:\nOn our last day, when checking under the bed before leaving, we found mould on the bed panels. As of writing this on 22nd September, both my baby and I are still unwell. Overall, this hotel is marketed as 5-star, but in reality, it’s closer to a 4-star with some 5-star amenities. The price is not justified for the experience we had, and cleanliness, hygiene, and child safety standards all need urgent improvement.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Bathroom",
      "Beach",
      "Bed",
      "Cleanliness",
      "Entertainment",
      "Fees",
      "Gym",
      "Housekeeping",
      "Noise",
      "Overall Value",
      "Parking",
      "Pool",
      "Proximity to Attractions",
      "Restaurant",
      "Room Service",
      "Spa",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Annoyance",
      "Approval",
      "Disappointment",
      "Disapproval",
      "Joy",
      "Neutral",
      "Realization",
      "Sadness"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_63",
    "rating": 5,
    "date": "2025-09-22",
    "location": null,
    "country": "Unknown",
    "comment": "We have had an absolute brilliant time. Staff our all so friendly and very welcoming. Olympic pool yusaf has been amazing to us each day. Massive 5* from me",
    "mainClasses": [
      "Amenities",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Pool",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_64",
    "rating": 5,
    "date": "2025-09-22",
    "location": "Peterborough, United Kingdom",
    "country": "United Kingdom",
    "comment": "Amazing experience at this resort, everything is easy to find, the staff are lovely and helpful too. The food has been fantastic with a lot of choice and the whole aesthetic of the hotel is stylish and beautiful. We booked a cabana on the beach for one of the days which was stunning, the views are amazing and our waiter Mustafa was so attentive and welcoming. Everything we asked for he got for us so quickly, always checking if we needed anything regularly and the actually cabana itself is clean, comfortable and gorgeous to look at! We will be coming back next year, 10/10 experience",
    "mainClasses": [
      "Amenities",
      "Food",
      "Value"
    ],
    "subClasses": [
      "Beach",
      "Entertainment",
      "Overall Value",
      "Pool",
      "Quality"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Optimism"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_65",
    "rating": 5,
    "date": "2025-09-21",
    "location": "Leek, United Kingdom",
    "country": "United Kingdom",
    "comment": "Food is plentiful in choice and taste. Hotel is very well kept and clean. Name branded drinks also, have not seen local stuff. Coca Cola products as well. Swimming pools not heated but warm up from sunshine. Kids club is fantastic. Soft play and play area well kept and maintained. Will be coming back.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value",
      "Pool",
      "Proximity to Attractions",
      "Quality"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_66",
    "rating": 5,
    "date": "2025-09-21",
    "location": null,
    "country": "Unknown",
    "comment": "Güzel bir tesis çalışanları dışında animasyon ekibinden girişte ki resepsiyona müşteri ilişkilerine kadar gerçekten bu tesisi hak etmeyen bir çalışan topluluğu ! Nezaketsizlik sorun çözememek ciddiyetsizlik gerçekten çok vahim. Beğendiğimiz tek şey yemeklerdi taa ki yemeğimiz de iğrenç kocaman bir saç çıkana kadar ve özürleri kabahatlerinden büyüktü.. bizimle iletişime geçen şef böyle şeylerin doğal olduğunu söyledi böyle mide bulandırıcı bir şey nasıl normal olabilirdi ki hayret ettik. Tesis harika sadece tesis harika başka bi beklentiniz olmasın 🥲",
    "mainClasses": [
      "Amenities",
      "Food",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Gym",
      "Overall Value",
      "Restaurant"
    ],
    "sentiments": [
      "Negative",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_67",
    "rating": 5,
    "date": "2025-09-20",
    "location": null,
    "country": "Unknown",
    "comment": "Brilliant hotel, staff can’t do enough for you. Cabanas are a wonderful treat Highly recommend this hotel 🤍🤍🤍🤩🤩🤩🤩",
    "mainClasses": [
      "Food",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Quality",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Food"
  },
  {
    "id": "review_68",
    "rating": 5,
    "date": "2025-09-20",
    "location": "London, United Kingdom",
    "country": "United Kingdom",
    "comment": "Excellent hotel with fabulous amenities …. Top class in every way apart from the boring pool music …. Repetitive and  annoying… need some well know music to listen to . Apart from that , can’t fault any of it !! Will be back next year …management please look in to different music at pool side as too techno . Need some fun music for the kids .",
    "mainClasses": [
      "Amenities",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Annoyance",
      "Joy",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_69",
    "rating": 5,
    "date": "2025-09-20",
    "location": null,
    "country": "Unknown",
    "comment": "So impressed with the service and facilities here the kids club is amazing open til very late and lots on offer for all ages. So many pool areas for the family to enjoy and the food is exceptional would definitely recommend to anyone with children",
    "mainClasses": [
      "Amenities",
      "Service"
    ],
    "subClasses": [
      "Entertainment",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Joy"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_70",
    "rating": 4,
    "date": "2025-09-19",
    "location": "Liverpool, United Kingdom",
    "country": "United Kingdom",
    "comment": "🏨 First Impressions & Check-In This was our first family holiday with our two little boys, and a special one for me personally, having grown up visiting Turkish all-inclusives. The hotel grounds and entrance were stunning—immaculately kept, beautifully designed, and Solaris Square in particular stood out with its gorgeous stonework. Unfortunately, check-in was disappointing. The staff member at the desk was slow and distracted, which made things difficult as we tried to manage two restless toddlers fresh off a 4.5-hour flight. We were simply handed a room key and told to scan a QR code for information. This lack of guidance meant we missed out on discovering some of the hotel’s facilities. 🛏️ Accommodation\nOur room was spacious, clean, and well-equipped. The beds were extremely comfortable, and we all slept well. The balcony door was stiff, which turned out to be a blessing with toddlers around. Bathrobes, slippers, and a good-sized wardrobe were provided, along with a modern TV. 🍽️ Food & Drink\nThe food was excellent and catered well to our varied needs—I'm a fussy eater, my husband is vegetarian, and one of our toddlers is autistic with ADHD. We all ate very well. Highlights:\nGozleme station: A breakfast favourite, with lovely staff who made us feel welcome despite the language barrier. Spaghetti Bolognese: A hit with our toddler. Turkish night: A personal favourite—Turkish cuisine is unbeatable! Italian snack restaurant: Divine fresh pizzas, highly recommended. Kids’ restaurant: Located in the kids club, open from around 12–6.30pm. A relaxed space where parents can dine without stress. Coffee & Treats:\nSchiller Point Coffee: Open 8am–12pm, a lovely touch. The iced mocha became part of our morning routine. Patisseries: Great for ice cream and waffles in the afternoon. Drinks Service:\nWe didn’t drink alcohol, but service was generally good. Some inconsistency with hot drinks—staff gave mixed messages about availability. Special mention to Arda and Beyzanur (aka Melanie Laurent) at the main bar for their friendly service. 🎉 Entertainment\nWe didn’t experience much of the evening entertainment due to our children’s bedtime, but we did stay up for the Michael Jackson show, which was impressive and well-coordinated. We’d love to explore more in future when the kids are older. 👶 Kids Facilities\nThe Kikoa Kids Club is the standout feature of this hotel. It’s unlike anything we’ve seen before. Facilities:\nHuge dedicated building with indoor soft play (open 9am–midnight), Lego room, arts and crafts, gaming room, and shaded outdoor play area. Everything is clean, air-conditioned, and thoughtfully designed. Water available at reception and a kids-only restaurant that made mealtimes stress-free. Evening mini disco at 8.30pm—our kids loved it, though I missed the usual disco classics! Honestly, the kids club was perfect and made the holiday for us. 💇 On-Site Services\nHairdresser: Prices were extremely high—€45 for a blow dry. I have long, thick hair with extensions, but still found this excessive. Gift Shop & Tattoos: Also overpriced. Photographers: We had a lovely family photoshoot. The team was patient and not pushy, and the photos are a cherished keepsake. 🚪 Facilities & Access\nLifts: A major issue. Only five lifts for the entire hotel, which led to long waits and crowding. We were on the 7th floor, so walking wasn’t an option with two toddlers. Information Access: The QR code system didn’t work well for us. We missed out on facilities like the beach snack bar and spa because we couldn’t find them or weren’t given clear directions. Staff often just referred us back to the QR code, which was frustrating. 🤔 Would I Return? Possibly, but only if I got a great deal. The kids club was outstanding and would be the main reason to return. However, the lack of clear information and guidance on arrival really impacted our experience. For a hotel of this standard, a more personal and informative welcome would make a big difference.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Beach",
      "Bed",
      "Breakfast",
      "Entertainment",
      "Fees",
      "Gym",
      "Housekeeping",
      "Neighborhood",
      "Overall Value",
      "Pool",
      "Price",
      "Quality",
      "Restaurant",
      "Room Service",
      "Spa",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Anger",
      "Approval",
      "Curiosity",
      "Disappointment",
      "Gratitude",
      "Joy",
      "Love",
      "Neutral",
      "Sadness"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_71",
    "rating": 5,
    "date": "2025-09-19",
    "location": "Oban, United Kingdom",
    "country": "United Kingdom",
    "comment": "This is our 2nd time at The titanic Lara hotel. Food and service is fabulous. Staff amazing and helpful. Cabana is a must, Aziz was our waiter and completely spoiled us. It was worth every penny.",
    "mainClasses": [
      "Location",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Proximity to Attractions",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Location"
  },
  {
    "id": "review_72",
    "rating": 5,
    "date": "2025-09-19",
    "location": "Edinburgh, United Kingdom",
    "country": "United Kingdom",
    "comment": "Kids club/ activities excellent service Sevilay very nice woman very helpful and great with the children. Children took part in football, bowling, drawing activities, surfing football, and lots more",
    "mainClasses": [
      "Amenities",
      "Service"
    ],
    "subClasses": [
      "Entertainment",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_73",
    "rating": 5,
    "date": "2025-09-19",
    "location": "Hungerford, United Kingdom",
    "country": "United Kingdom",
    "comment": "Second time and amazing ! Emre-  such amazing people ! I really do love this place \nAnd the cabanas make out holiday even more amazing",
    "mainClasses": [
      "Amenities",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_74",
    "rating": 5,
    "date": "2025-09-17",
    "location": null,
    "country": "Unknown",
    "comment": "Personeller harika özellikle misafir ilişkilerinden Merve hanim ile tanınıştığıma çok memnum oldum❤️❤️❤️❤️😍😍😍",
    "mainClasses": [
      "Service"
    ],
    "subClasses": [
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_75",
    "rating": 5,
    "date": "2025-09-17",
    "location": "Hamburg, Germany",
    "country": "Germany",
    "comment": "kez tercih ettik çok memnun kaldik. Emre Bey’e ilgisi için çok teşekkür ederiz.",
    "mainClasses": [
      "Service",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Gratitude",
      "Joy"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_76",
    "rating": 4,
    "date": "2025-09-17",
    "location": null,
    "country": "Unknown",
    "comment": "and kid activities very nice and the food delicious thanks for coach team football sevilay and kids club the best Only problem with cooling the room The location is excellent, all the staff are lovely.",
    "mainClasses": [
      "Location"
    ],
    "subClasses": [
      "Proximity to Attractions"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Gratitude"
    ],
    "sentiment": "Positive",
    "category": "Location"
  },
  {
    "id": "review_77",
    "rating": 5,
    "date": "2025-09-17",
    "location": "Arlington, Virginia",
    "country": "Virginia",
    "comment": "Wir sind seit einer Woche im Titanic Deluxe und es wirklich wunderschön. Es gibt genug Plätze zum liegen und immer eine Riesen Auswahl am Essen. Die Cocktails sind sehr gut und das Cleaning ist auch immer super ordentlich. Die Partys am Abend sind auch super.",
    "mainClasses": [
      "Amenities",
      "Service"
    ],
    "subClasses": [
      "Entertainment",
      "Housekeeping",
      "Parking",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_78",
    "rating": 5,
    "date": "2025-09-17",
    "location": null,
    "country": "Unknown",
    "comment": "First visit to this hotel. Happy with the room, food and facilities. All the staff are very helpful. Will return in the future.",
    "mainClasses": [
      "Amenities",
      "Location",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value",
      "Proximity to Attractions",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Caring",
      "Joy",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_79",
    "rating": 5,
    "date": "2025-09-16",
    "location": null,
    "country": "Unknown",
    "comment": "Hotels absolutely spot on and the kids club is great for the kids, shows on for the kids at there own private stage area every night, games rooms with multiple ps5s and Xbox’s, children’s entertainment is spot on huge area for them. Branded drinks also available, the Ala Carte restaurants are amazing too, the steak restaurant was amazing, got to select your own cut of steak from the counter and cooked at your table on a stone. Rooms were tidy and clean. Pool area for the adults at Olympic swimming pool absolutely spot on. Kids pool slides and area fantastic and all clean and well looked after. The Italian restaurant was amazing on the way down to the beach. The main buffet restaurant was also spot on huge selections of food. ( although can get very busy) Would I come back yes without a doubt.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Value"
    ],
    "subClasses": [
      "Cleanliness",
      "Entertainment",
      "Overall Value",
      "Pool",
      "Proximity to Attractions",
      "Restaurant"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_80",
    "rating": 5,
    "date": "2025-09-15",
    "location": "Penrith, United Kingdom",
    "country": "United Kingdom",
    "comment": "We had a wonderful family holiday. Check in could have been better. It seemed to take for ever. A welcome drink would be nice and no information was given upon check in. The rooms were lovely and clean. There was everything you needed and more. The beds were very comfortable. The food was incredible. There were 6 of us. Always a table too, different cuisines and meats every day. The pools were clean and the staff were lovely. We ate in the Italian restaurant and the service was 11/10. A couple of things which were NOT good. The floors at the  pools are treacherous. We saw people fall and slip daily. My daughter saw a lady knock herself out cold. The towel situation is ridiculous! If you dont get up early there are no poolside beds. My daughter got up one morning at 6 30 am so we could have good views and they removed all our towels. In my opion obviously you can't put them out at night but if you make the effort to get of bed early then you deserve the best sun loungers. First come first serve. The problem is the towel removel is very inconsistent. They removed ours but not others! I then had to search for them. They were wet in a pile on the floor. The sea cabana was lovely. Aziz was on the ball. I would recommend that. All the staff work hard and do an incredible job. The coffee was divine in the coffee hut. I would definitely recommend this hotel. Hopefully the managers will rethink the towel situation and the very slippery poolside. There is so much to do. My 19 year old twins did SUP exercises, my daughter ( 11 ) did waterpolo and football. My 10 year old made squishy and had her face painted. My husband played volleyball. The spa was fantastic 👌. So many positive things. The entertainment was very good.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Beach",
      "Cleanliness",
      "Entertainment",
      "Neighborhood",
      "Overall Value",
      "Pool",
      "Proximity to Attractions",
      "Quality",
      "Restaurant",
      "Room Service",
      "Spa",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Annoyance",
      "Approval",
      "Disapproval",
      "Joy",
      "Neutral",
      "Optimism",
      "Sadness"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_81",
    "rating": 5,
    "date": "2025-09-14",
    "location": null,
    "country": "Unknown",
    "comment": "Heel goed en (kind) vriendelijk hotel!! Wij hebben elke dag Cabanas gehuurd, Merve kwam regelmatig kijken hoe het ging en of we tevreden waren! Als er iets was konden we dat aangeven. Dit is al de tweede keer dat we hier zijn en nog even goed! Ook het personeel van de Cabanas zijn erg vriendelijk!",
    "mainClasses": [
      "Location",
      "Service"
    ],
    "subClasses": [
      "Accessibility",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Joy",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Location"
  },
  {
    "id": "review_82",
    "rating": 5,
    "date": "2025-09-14",
    "location": null,
    "country": "Unknown",
    "comment": "Otele defalarca geldim ve gelmeye devam ederim. Otele cabana servisi için geliyorum. Cabana servisi ve personelleri harika. Aziz, Murat, Erkan, Hüseyin, ve Ahmet özellikle kendilerine teşekkür ederiz.",
    "mainClasses": [
      "Amenities",
      "Location",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value",
      "Proximity to Attractions",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_83",
    "rating": 5,
    "date": "2025-09-14",
    "location": null,
    "country": "Unknown",
    "comment": "Titanic Lara Hotel’de harika bir tatil geçirdik! 🌟 Özellikle animasyon ve eğlence ekibi mükemmeldi – her zaman enerjik, güler yüzlü ve akşam şovları gerçekten çok eğlenceliydi. Gün içindeki aktiviteler çok iyi organize edilmişti, hem eğlendik hem de yeni insanlarla tanışma fırsatı bulduk. Misafir ilişkilerinden Merve’ye ayrıca teşekkür etmek istiyoruz! Her zaman nazik, yardımsever ve tüm isteklerimizle ilgilendi. İşini ne kadar severek yaptığını hissettirdi.",
    "mainClasses": [
      "Amenities",
      "Location",
      "Service"
    ],
    "subClasses": [
      "Entertainment",
      "Sea View",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude",
      "Neutral",
      "Sadness"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_84",
    "rating": 2,
    "date": "2025-09-13",
    "location": "London, United Kingdom",
    "country": "United Kingdom",
    "comment": "First impressions of Titanic Lara Beach Hotel are good thanks to its excellent location and impressive grounds, but unfortunately the stay itself was disappointing. The rooms felt old and tired, with broken tiles and visible wear that didn’t match the hotel’s 5-star image. The food was another letdown — the buffet was very repetitive, serving almost the same dishes every day. Although the booking was all-inclusive, we were surprised to find extra charges for the other restaurants, which felt misleading. Service in the restaurants was also poor. Dirty plates were often left on the tables and rarely cleared away. Communication was difficult, as most staff did not speak English or French, making even simple requests frustrating. The hotel felt overcrowded, and there were far too few staff to cope with the demand. I genuinely felt sorry for the staff, as they were clearly working hard but overstretched. Facilities were also below standard. None of the jacuzzis were working during our stay, which was very disappointing. Overall, while the location and appearance of Titanic Lara Beach Hotel are strong, the experience was let down by outdated rooms, repetitive food, poor service, overcrowding, and facilities that failed to live up to expectations.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Bed",
      "Entertainment",
      "Housekeeping",
      "Overall Value",
      "Proximity to Attractions",
      "Restaurant",
      "Spa",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative"
    ],
    "emotions": [
      "Admiration",
      "Annoyance",
      "Disappointment",
      "Neutral",
      "Remorse",
      "Surprise"
    ],
    "sentiment": "Negative",
    "category": "Amenities"
  },
  {
    "id": "review_85",
    "rating": 5,
    "date": "2025-09-12",
    "location": null,
    "country": "Unknown",
    "comment": "We had a great stay, very friendly staff, excellent food and facilities. Booked a couple of the cabanas and whilst they were expensive they were a real treat. Entertainment was good although we didn’t attend every evening. Pools (notably those aimed at children) could get busy (well it was peak season) with people staying on their sunbeds from early morning to secure a spot but I think this is typical or most resorts. Scuba trip was good value overall and done very well. Family stay with 2 boys (11 & 15).",
    "mainClasses": [
      "Amenities",
      "Room",
      "Value"
    ],
    "subClasses": [
      "Bed",
      "Entertainment",
      "Overall Value",
      "Pool"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_86",
    "rating": 4,
    "date": "2025-09-12",
    "location": null,
    "country": "Unknown",
    "comment": "Der erste Eindruck war blosser Hammer: aufgrund der Info, dass unser Ankunftstag auch unser Hochzeitstag war, fanden wir im „Wohnzimmer“ unserer 2 Standartzimmer(im 8. Stock wohlgemerkt) liebevolle Schoko-Und Weingrüsse! Die beiden Zimmer, die wir gebucht haben, waren echt super mit einer riesigen Terrasse! Weil unsere Kleider nach dem täglichen Besuchs des Restaurants nach Essen stinkte, das Essen frisch vom Büffet stellenweise eiskalt war, statt heiss, das Zimmermädchen zwar das Trinkgeld einkassierte, aber mein Pyjama direkt unter dem Wasserablauf der Kaffeemaschine steckte (Guestrelation hat sich zwar umgehend darum gekümmert, nachdem wir reklamiert haben!)\nAbsolut empfehlenswert, wer sich ein wenig Luxus leisten möchte: Beach front cabanas: Hier zu erwähnen, Ahmet, der wirklich mit super Aufmerksamkeit uns verwöhnte! Weniger für 4 Personen, wenn nicht eine davon sich in der Sonne braten möchte: Ocean Pool cabanas: zu eng! Für denselben Preis wie Beach Front! Geniale Shows am Abend und gutes Sportprogramm",
    "mainClasses": [
      "Amenities",
      "Location",
      "Room",
      "Value"
    ],
    "subClasses": [
      "Beach",
      "Entertainment",
      "Neighborhood",
      "Overall Value",
      "Pool",
      "View"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Love",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_87",
    "rating": 5,
    "date": "2025-09-12",
    "location": null,
    "country": "Unknown",
    "comment": "This is our 3rd time here, we love it here staff are friendly and helpful. We would recommend here , staff, entertainment and food is 5*.",
    "mainClasses": [
      "Service"
    ],
    "subClasses": [
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Love",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_88",
    "rating": 3,
    "date": "2025-09-12",
    "location": null,
    "country": "Unknown",
    "comment": "A very smart hotel. The room was a bit on the small side for the mo et as our two children shared a sofa bed. The food was very good especially the Turkish options. For us the thing that spoilt it was the sunbeds. Everyone reserved sun beds and even at half 7 in the morning all the good ones had gone. With 2 small children this made the holiday hard work as we couldn't sit near enough the pool to see them. No policing the sun beds doesn't seemingly work. It was very hot that week so made this even more of a problem. We ended up paying out £175 for a cabana on the pier to have a day off the battle of it. The cabana was great but we shouldn't have felt we needed to do that.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Value"
    ],
    "subClasses": [
      "Beach",
      "Bed",
      "Entertainment",
      "Overall Value",
      "Pool",
      "Proximity to Attractions",
      "Quality",
      "Spa"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Disapproval",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_89",
    "rating": 5,
    "date": "2025-09-11",
    "location": null,
    "country": "Unknown",
    "comment": "Great pleace to stay, everyone is so friendly the cabanas are amazing a must book honestly and the kids waterpark is so great!!",
    "mainClasses": [
      "Amenities"
    ],
    "subClasses": [
      "Entertainment"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_90",
    "rating": 4,
    "date": "2025-09-11",
    "location": null,
    "country": "Unknown",
    "comment": "Wij hebben een fantastische tijd gehad in dit hotel! Alles was tot in de puntjes verzorgd: de kamers waren schoon en comfortabel, het eten gevarieerd en erg lekker, en de faciliteiten boden alles wat je nodig hebt voor een ontspannen vakantie. Het personeel was overal vriendelijk en behulpzaam, waardoor je je echt welkom voelt. Het zwembad en de algemene sfeer zorgden voor pure ontspanning. Zeker een plek waar we graag nog eens terugkomen! Angela verdient echt een speciale vermelding! Zij heeft onze vakantie extra bijzonder gemaakt. Haar enthousiasme, energie en warmte zijn aanstekelijk. Ze weet iedereen – jong en oud – erbij te betrekken en zorgt altijd voor een glimlach. Dankzij haar voelden de activiteiten nooit verplicht, maar juist super leuk. Angela is niet alleen professioneel, maar ook oprecht betrokken en dat maakt een wereld van verschil. Een echte topper in het animatieteam!",
    "mainClasses": [
      "Amenities",
      "Location",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Neighborhood",
      "Overall Value",
      "Pool",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Approval",
      "Excitement",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_91",
    "rating": 5,
    "date": "2025-09-11",
    "location": null,
    "country": "Unknown",
    "comment": "This is my 2nd stay here. I would never normally go somewhere twice but the hotel is lovely and the staff are all so kind and friendly.",
    "mainClasses": [
      "Location",
      "Service"
    ],
    "subClasses": [
      "Neighborhood",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Location"
  },
  {
    "id": "review_92",
    "rating": 5,
    "date": "2025-09-11",
    "location": null,
    "country": "Unknown",
    "comment": "İyi eğlence iyi Kids clup güzel bir Titanic festivali animssyondan yiğit ile enerjik geçirilen zaman herşeye değdi teşekkür ederiz mutluyuz",
    "mainClasses": [
      "Value"
    ],
    "subClasses": [
      "Overall Value"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Gratitude"
    ],
    "sentiment": "Positive",
    "category": "Value"
  },
  {
    "id": "review_93",
    "rating": 1,
    "date": "2025-09-11",
    "location": null,
    "country": "Unknown",
    "comment": "Хочу поделиться  своими впечатлениями!! За 5 часов до вылета самолёта  в Турцию на отдых в этот отель мне пришло уведомление, что  нас отель принять не может!!! На руках уже оплачены билеты на самолёт, страховка, ваучер на проживание в этом отеле! И тут такой сюрприз! Что за отношение к гостям. Такое  со мною впервые произошло! Вот так доверять  отдых! Надеюсь эта информация  о возможном  обмане всем  желающим отдохнуть в этом отеле  пригодится!!",
    "mainClasses": [
      "Amenities",
      "Location",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Entertainment",
      "Housekeeping",
      "Neighborhood",
      "Overall Value",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Caring",
      "Desire",
      "Love",
      "Neutral",
      "Realization",
      "Surprise"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_94",
    "rating": 4,
    "date": "2025-09-10",
    "location": null,
    "country": "Unknown",
    "comment": "Karşılama da ikram vs yoktu oda teslimi 14 den sonra yapıldı ve 3 kişilik rezervasyonumuzda oda hazırlanmamıştı. Oda ve banyo restore edilmeli. Duşa kabin kapısının olmaması ve giderin arızalı olması sorun oluşturdu. Temizlik olarak iyiydi fakat kişisel bakım ürünleri talebe istinaden yenilendi. Yemek çeşitliliği, sncak restoranlar, waffle-kumpir-dondurma büfeleri oldukça başarılı ve lezzetliydi. Çok fazla yabancı garsonun çalışması iletişim kopukluğuna sebep oluyordu ve içecek servisleri çok geç yapıldı yani yemek bittiğinde içecek geliyordu. Bunlar haricinde havuz ve eğlence anlamında oldukça başarılıydı. Tatil sonunda hatıra hediyesi talep ettik, tavırlarını samimi bulmadık birçok otel deneyimim olarak plaj çantası, termos vs almıştım bunun olmaması üslup beni şaşırttı. Genel anlamda dinlendiğimiz, keyifli vakit geçirdiğimiz bir tatil oldu teşekkürler TİTANİC DELUXE LARA…",
    "mainClasses": [
      "Amenities",
      "Food",
      "Room",
      "Service"
    ],
    "subClasses": [
      "Bathroom",
      "Beach",
      "Bed",
      "Entertainment",
      "Pool",
      "Restaurant",
      "Spa",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Disapproval",
      "Gratitude",
      "Neutral",
      "Surprise"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_95",
    "rating": 5,
    "date": "2025-09-10",
    "location": "Lymm, United Kingdom",
    "country": "United Kingdom",
    "comment": "This is our third time the hotel amazing cabana services great thanks Ahmet and Aziz. Entertainment brilliant thank you yiğit. Guest relations super thank you Merve",
    "mainClasses": [
      "Service",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Gratitude"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_96",
    "rating": 5,
    "date": "2025-09-10",
    "location": null,
    "country": "Unknown",
    "comment": "The hotel is lovely entertainment amazing 🤩Yiğit super and rollerblade guy Yusuf amazing with services. Thank you Merve from guest relations",
    "mainClasses": [
      "Service",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_97",
    "rating": 5,
    "date": "2025-09-10",
    "location": null,
    "country": "Unknown",
    "comment": "We’ve just returned from a fantastic family holiday at Titanic Deluxe Lara, and overall, we were truly impressed. The hotel grounds and swimming pools are immaculate, and our room was spacious, comfortable, and cleaned daily. Everything felt spotless and well looked after. The staff were incredibly friendly and genuinely helpful, always ready with a smile and happy to assist with anything we needed. A special mention goes to Hussain from the cabana team, who was absolutely brilliant – he made us feel incredibly welcome from the moment we arrived and looked after us throughout the entire stay. His attention to detail and kindness really made a difference to our experience. We’ve actually already booked to return next year, and we honestly can’t wait! The food could have been slightly better in terms of flavour and variety, but that’s partly down to our fussy toddler – we often face the same issue wherever we go. There’s still plenty of choice, so most guests should have no problem finding something they enjoy. One tip: don’t wait for the waiters – you’ll be waiting a while. Just go to the bar yourself and you’ll save a lot of time. Sunbeds are definitely an issue – especially ones with parasols. After trying two mornings in a row with no luck, we booked a cabana for the rest of our stay, which was honestly a lifesaver with a toddler. However, they could use a little love – a lick of paint and new fridges would go a long way. We did have one hiccup where our cabana was double booked, but the cabana team handled it amazingly. They offered us an upgrade to a pier cabana with a jacuzzi at the same price, which was a really kind gesture – we declined only because our daughter couldn’t be in full sun all day. The situation was resolved smoothly when another guest kindly agreed to swap. Unfortunately, Guest Relations turned up late to the party and added zero value. When I explained why we couldn’t move to the pier, he responded with “What’s wrong with her?” – which was neither professional nor appropriate. Let’s just say I politely asked him to leave. Honestly, he was about as helpful as a lifeguard at a puddle. The entertainment was decent, but often split between the outdoor stage and the amphitheatre, which means you might find yourself doing a bit of back-and-forth if you want to catch everything. Not a huge deal, just something to know. Breakfast and dinner times can be very chaotic – lots of families, lots of noise, and children running freely. If you prefer a calmer meal, try going a bit earlier or later to avoid peak madness. •\tBring euros, not lira – everything is priced in euros, and staff clearly prefer them. •\tTipping is not expected, but it’s definitely appreciated – and the service deserves it. •\tThere’s a great shopping centre 10 minutes away with loads of options for both kids and adults – perfect if you fancy a break from the resort. •\tThe on-site market is the only major letdown – hugely overpriced and not in line with the quality of the rest of the hotel. •\tOh, and one more thing: if you’re excited about using the big slides, just brace yourself – the slide tower smells like fresh urine. So by all means, knock yourself out if that’s your thing. Despite a few small bumps, we had a brilliant time. The positives massively outweigh the negatives, and the team, especially people like Hussain, made us feel so welcome and looked after. We’re already counting down the days to next year’s return – and we’re hoping for the same great experience (and hopefully a fresh fridge in the cabana 😄). Highly recommended for a fun, family-friendly holiday!",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Breakfast",
      "Entertainment",
      "Neighborhood",
      "Overall Value",
      "Pool",
      "Price",
      "Proximity to Attractions",
      "Quality",
      "Restaurant",
      "Room Service",
      "Spa",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Caring",
      "Confusion",
      "Disappointment",
      "Excitement",
      "Gratitude",
      "Joy",
      "Neutral",
      "Optimism"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_98",
    "rating": 3,
    "date": "2025-09-09",
    "location": null,
    "country": "Unknown",
    "comment": "I would love to give this hotel the full 5 stars as the food was brilliant to the point we didn’t even use our a-la-cart voucher we got given on arrival. The staff for the pool, bar, cleaning and kids areas were great. The thing that let this hotel down is where you would had thought they would had exceeded most, the part you paid extra for - on one of our days we paid £175 to have a cabana on the pier which comes with our own server who sorts you out whatever drinks and food you would like from 9:30 am to 5:30pm. At around 2 the server who was doing a great job had to leave but from that point on no one was then allocated our cabana so we stopped getting the service that we had. I did bring it up but nothing was done so most of the time we were getting up and going to the bar ourselves. I would also like to mention for anyone who is thinking or is going to this hotel to avoid the hair salon within the hotel on -1 floor. We had our daughter’s hair done there on an agreed price. Once completed they tried to charge a different fee, when I questioned it the guy became extremely aggressive even with me holding my 6 month old baby saying if I don’t pay he will bring my daughter back in and rip it out from her hair. I decided to pay a bit more so that I could leave and not scare my kids any more than they were. I reported this to the hotel who again done nothing only to say they are not really part of the hotel. Yet they do their business within it. Other than these 2 experiences  it was a great holiday",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Entertainment",
      "Fees",
      "Overall Value",
      "Proximity to Attractions",
      "Quality",
      "Room Service",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Fear",
      "Love",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_99",
    "rating": 3,
    "date": "2025-09-09",
    "location": "Alwalton, United Kingdom",
    "country": "United Kingdom",
    "comment": "We recently stayed at Titanic Deluxe Lara and while the hotel itself is undeniably beautiful—with well-maintained grounds, a lively atmosphere, and solid amenities—it didn’t quite live up to the price tag. The rooms were comfortable and the beach access was a definite highlight. The entertainment options were varied and fun, especially for families. Staff were generally helpful, and the location near the airport and local shops was convenient. That said, for what we paid, we expected more. There are several nearby resorts offering similar or even better facilities at more reasonable rates. The value for money just wasn’t there, especially when compared to other all-inclusive options in the area. Dining was good, but not exceptional, and some services felt a bit stretched during peak times. Overall, it’s a good hotel—but if you're looking for top-tier luxury or exceptional value, you might want to explore other resorts in Lara.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Beach",
      "Entertainment",
      "Fees",
      "Overall Value",
      "Price",
      "Quality",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Approval",
      "Joy",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_100",
    "rating": 5,
    "date": "2025-09-09",
    "location": null,
    "country": "Unknown",
    "comment": "Really fantastic enterteinment really good activities and from animations team yigit was great world class luxury for us thank you for rverythinkk yigitttt thank you titanic family",
    "mainClasses": [
      "Amenities"
    ],
    "subClasses": [
      "Entertainment"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Gratitude"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_101",
    "rating": 5,
    "date": "2025-09-09",
    "location": null,
    "country": "Unknown",
    "comment": "Müşteri İlişkilerinde yer alan Mustafa Bey'e yardımlarından dolayı çok teşekkür ederiz. Oteli herkese tavsiye ederiz.",
    "mainClasses": [
      "Service"
    ],
    "subClasses": [
      "Room Service",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Gratitude",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_102",
    "rating": 3,
    "date": "2025-09-09",
    "location": "Izmir, Türkiye",
    "country": "Türkiye",
    "comment": "2023 yılında Titanic Belek’te çok güzel bir tatil geçirmiştik, bu nedenle bu yıl Lara otelini tercih ettik. Ancak maalesef hizmet kalitesi açısından ciddi bir gerileme gözlemledik. Öncelikle şunu belirtmek gerekir ki 2023 yılına kıyasla böyle bir otelde hizmetin bu kadar geriye gitmesi şaşırtıcı oldu. otelde çok büyük bir personel yetmezliği var, 6 günlük tatilimizde maalesef bu personel sorununu çok kez yaşadık Titanic gibi kendini üst segmentte sınıflayan bir otelde böyle bir durum kabul edilemez. Tam 3 gün sabah kahvaltısında çaylarımız kahvaltının ortasında geldi 1 kere de hiç gelmedi, 20 masaya 1 personel görevlendirilmiş ve bu kişi hem servis hem dolum işlerini yapıyor dolayısıyla sıra size gelene kadar siz yemeği yarılamış oluyorsunuz, burada personeller kesinlikle sürekli koşturma halinde özverililer ama sonuçta onlar da insan ve bir kapasiteleri var ve kalabalığa yetemiyorlar diğer konu da içecek hazırlanmasında her barmen arkadaş tamamen özgür reçete kokteyl hazırlıyor, 5 farklı barda aynı kokteyli 5 farklı tatta içebilirsiniz, 5 barın hiçbirinde shaker görmedim, arkadaşlar bardakları birbiriyle kapatarak karıştırıyordu kokteyli, burada da net bir personel yetmezliği vardı, özetle personel eksikliği kaynaklı hizmet kalitesi 2 senede çok çok geriye gitmiş. yemek çeşitliğiliği ve lezzeti genel olarak gayet iyidi, her gece kırmızı et, beyaz et, balık, hindi çeşitleri vardı, meze ve soğuklar kısmında tekrar eden çok çeşit vardı, her gece aynı şeyleri görüyorsunuz. füme et şanslıysanız bulursunuz çünkü diğer salam ürünleri ürünler bittikçe yenilenirken biraz pahalı olduğundan olsa gerek füme etler bitince tabağı boş kalıyor :) kapalı dondurma yok, sadece açık dondurma bulabiliyorsunuz, kapalı olarak sunulan içecek neredeyse yok sadece 1 tane bira çeşidi kapalı olarak veriliyordu. ücreti ile alakart hizmeti alarak Yamas restoranı denedik, 3.kadehten sonra istediğim rakı olan beylerbeyi kalmamış diye yeni rakı verdiler, içeride parasını verip bile istediğinizi içemiyorsunuz maalesef. gelelim iyi yanlara otelin kids club kısmı Antalyanın belki de en iyisi, çocuklar için her türlü aktivite düşünülmüş, havuzlar ve şezlong gayet yeterli, tıpkı Belek gibi burada da her yer pavilion dolmuş, aqua kısmı yeterli. özetle bizde çok güzel anıları olan bir otelin bu kadar geriye gitmiş olması hem şaşırttı hem üzdü, bundan sonra Titanicte tatil yapacak olanlar çok büyük beklentiye girmeden gitmeleri tavsiyedir.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Service"
    ],
    "subClasses": [
      "Bar",
      "Pool",
      "Proximity to Attractions",
      "Restaurant",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Disappointment",
      "Disapproval",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_103",
    "rating": 5,
    "date": "2025-09-09",
    "location": null,
    "country": "Unknown",
    "comment": "De service is goed het eten, er is hier veel te doen, hotel is mooi, verschillende zwembaden, kamer is mooi, verschillende barren zijn hier, echt een top locatie",
    "mainClasses": [
      "Amenities"
    ],
    "subClasses": [
      "Entertainment"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_104",
    "rating": 5,
    "date": "2025-09-08",
    "location": "Tirana, Albania",
    "country": "Albania",
    "comment": "Titanic Deluxe Lara great hotel. Tasty food, comfortable rooms, frendly staff. Specialy thanks animator Ekaterina for her positivy energy and good activity.",
    "mainClasses": [
      "Amenities",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Gratitude",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_105",
    "rating": 5,
    "date": "2025-09-08",
    "location": null,
    "country": "Unknown",
    "comment": "Eerste keer in hotel mooi hotel uitstekend personeel mooi muziek uitstekend eten zeker om nog keer te komen echt wel gr geurt",
    "mainClasses": [
      "Amenities"
    ],
    "subClasses": [
      "Entertainment"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_106",
    "rating": 5,
    "date": "2025-09-08",
    "location": null,
    "country": "Unknown",
    "comment": "Great kids club, relaxing environment, night entertainment is amazing and so much effort put into it. Snack bars have better food than the main buffet area",
    "mainClasses": [
      "Amenities",
      "Food"
    ],
    "subClasses": [
      "Bar",
      "Entertainment"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_107",
    "rating": 5,
    "date": "2025-09-08",
    "location": null,
    "country": "Unknown",
    "comment": "We had a great trip at the Titianic Deluxe Hotel. We hired the large cabana for my birthday which was amazing. Mustafa was super accommodating and helpful!😊👏🏼⭐️",
    "mainClasses": [
      "Amenities",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Pool",
      "Spa"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_108",
    "rating": 5,
    "date": "2025-09-08",
    "location": null,
    "country": "Unknown",
    "comment": "The hotel is so beautiful and clean. Food delicious 😋 services great. Everyone is very friendly and helpful especially Yusuf from snack restaurant and Merve from guest relations. I recommend this hotel to everyone especially.",
    "mainClasses": [
      "Amenities",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Approval"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_109",
    "rating": 2,
    "date": "2025-09-07",
    "location": null,
    "country": "Unknown",
    "comment": "Otel odaları temizlik çok kötü otel içi havuz kenarlar ve iskele hep cabana var hepsi ücretli ultra dahil olmasına rağmen eğlence yapıyorlar loca adı aştında yine ücret istiyorlar yemekleri hep aynı",
    "mainClasses": [
      "Amenities"
    ],
    "subClasses": [
      "Entertainment"
    ],
    "sentiments": [
      "Negative"
    ],
    "emotions": [
      "Amusement"
    ],
    "sentiment": "Negative",
    "category": "Amenities"
  },
  {
    "id": "review_110",
    "rating": 5,
    "date": "2025-09-07",
    "location": null,
    "country": "Unknown",
    "comment": "Сераис, кухня, тбслуживаерие, персонал - отличная команда! Ергин отличный помощник нам в получении в ех доступных услуг отеля!",
    "mainClasses": [
      "Amenities"
    ],
    "subClasses": [
      "Entertainment",
      "Gym"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_111",
    "rating": 4,
    "date": "2025-09-07",
    "location": "Bournemouth, United Kingdom",
    "country": "United Kingdom",
    "comment": "I wouldn’t say this is a 5* hotel, more like a very good 4*. Firstly, the positives:\nPlenty of options for breakfast and dinner, and generally very decent. As anywhere, of course, it’s a bit repetitive; however, I always found something to tickle my fancy, and my husband, on the other hand, struggled not to overeat with the options available. Lunches in the two restaurants by the beach were by far 11/10! The wraps and pizza were to die for. Desserts were also always a huge hit; my only gripe was that the desserts were too big, so it was hard to try lots of options, and ice cream was delicious. Drinks were always a hit; cocktails are some of the best I’ve ever had at an all-inclusive and were always tasty. The pool was fun; we always went there in the late afternoon when people were leaving, as that’s when we managed to get a decent sunbed. We discovered the best place for us to chill was on the pier at the end, in the middle, where there are sunbeds right next to the bar. We never bothered booking a cabana as we didn’t feel the need to. The breeze on the pier was always so welcome. The entertainment was good; we enjoyed ourselves at the white party. We also played pool and went bowling, which was never a problem booking. It was a nice touch being part of the hotel and not having to pay extra for it. The bar here was always so good, and the décor was lovely. We also booked the spa on our last day and paid €220 for me and my husband to have a Turkish bath (30 mins) and massage (50 mins), which was really good. Now, the negatives are that it’s mainly about the bedroom. The décor is outdated, but the biggest problem was the smell of cigarettes in the room. I did complain about this when guest services called the next morning and said they would fix it, which they said they did. How I don’t know because it still smelt the same, and nor did they move us to another room. It did, however, have good toiletries and a minibar. Another issue we had was that the electricity went twice in one day, and the second time it took almost an hour to resolve. Not quite what you expect from a 5* hotel. The last thing was that they disabled the room key the night before. We had got to the room to find both keys disabled and had to go to reception for them to say you have to settle your bill today, which is stupid as your money is in your room, which they’ve now blocked you out of. I don’t understand why this cannot be done on the day of checkout, like what normal hotels do, especially a 5*. Overall, we actually had an amazing time despite the niggles. Would I recommend it? Yes, would I return no more because we always like to try somewhere new. There are definitely things the hotel can work on.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Beach",
      "Bed",
      "Entertainment",
      "Neighborhood",
      "Noise",
      "Overall Value",
      "Pool",
      "Price",
      "Proximity to Attractions",
      "Quality",
      "Restaurant",
      "Spa",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Annoyance",
      "Approval",
      "Confusion",
      "Curiosity",
      "Disapproval",
      "Gratitude",
      "Joy",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_112",
    "rating": 5,
    "date": "2025-09-07",
    "location": null,
    "country": "Unknown",
    "comment": "È stata una vacanza meravigliosa \nAbbiamo viaggiato con un bimbo di 9 mesi che pure lui si è divertito un mondo con tutta l’area giochi e anche le piscine",
    "mainClasses": [
      "Amenities"
    ],
    "subClasses": [
      "Entertainment"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Joy"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_113",
    "rating": 5,
    "date": "2025-09-07",
    "location": null,
    "country": "Unknown",
    "comment": "E stata un esperienza meravigliosa \nSecondo me il hotel migliore con tutto dentro\nAdatto a famiglie con bambini p\nPensato per tutte le età con tanto divertimento",
    "mainClasses": [
      "Amenities"
    ],
    "subClasses": [
      "Entertainment"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Joy"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_114",
    "rating": 5,
    "date": "2025-09-07",
    "location": null,
    "country": "Unknown",
    "comment": "Une belle expérience , hôtel bien agréable ! La plage de sable ainsi que les piscines ou l’on passe de bons moments \nUn service au top",
    "mainClasses": [
      "Amenities"
    ],
    "subClasses": [
      "Beach",
      "Entertainment"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Joy"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_115",
    "rating": 5,
    "date": "2025-09-07",
    "location": null,
    "country": "Unknown",
    "comment": "Best hôtel so far, we usually been around but this is also Nice and clean and also spécial thanks Ergin from guest relation",
    "mainClasses": [
      "Value"
    ],
    "subClasses": [
      "Overall Value"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Gratitude"
    ],
    "sentiment": "Positive",
    "category": "Value"
  },
  {
    "id": "review_116",
    "rating": 4,
    "date": "2025-09-07",
    "location": "Istanbul, Türkiye",
    "country": "Türkiye",
    "comment": "Titanicdeluxelara ; deluxe kısmını çıkarırsak gayet iyi bir otel olduğunu düşünüyorum tabi bu beklenti ilede  alakalı olan bir durum.Gelelim iyi ve kötü yönlerine  otele erken gelmemize  rağmen odamız hemen hazırlandı ve  içeri giriş yaptık 3101 ve 02 de kaldık odalar biraz ufak olmasına rağmen havuzla direk bağlantısı olduğu  için çok memnun kaldık .👍Otel geniş bir alanda ve hiç birsey iç içe degil gayet guzel dizayn edilmiş şezlong bulamama gibi birsey yok şezlonglar zaten çok rahat  havuzlar büyük ve geniş burada bir sorun yok .👍Deniz kısmında ise buyuk sıkıntılar var  iskele yapmış heryere cabana  koymuş , bir sahil ve iskele anca bu kadar ticari düşünülür ama bana göre daha cok şey kaybediyorlar haberleri yok , heleki hic biryer de görmediğim  sadece burada şahit olduğum iskele alti demiyorum ama merdivenin de insan alerji olur mu ? Evet olduk hepimiz sırayla bacak kısmınından alerjik reaksiyon lar gösterdik kiminde az kiminde daha fazla oldu ama burada bir sıkıntı var varsa da temizleyin kardeşim ne alaka yani benim bacağım  merdivene değince alerji olmak zorunda mı? ilk defa böyle birsey le karşılaştım o yüzden deniz bende soru işareti kaldi .👎Yemekler bence başarılı et herzaman ve hergun var   ben özellikle açık büfe şefini tebrik ediyorum lezzetli ve titiz işler yapmış👍 ama  alacert larin  hepsinin ücretli olması bence çok kötü bir durum  en azından 1 gece hediye edilmeli diye düşünüyorum.👎  Acik bufede garsonlar her nekadar isini yapmaya calişsada  yetersiz kaliyorlar heleki kahvaltida cay icmeniz skandala donusuyor .Zaten oteller artik acik bufeyi kaldirmali yazuk günah cok şey çöp oluyor onun yerine siparişle verilse oteller inanın daha karlı çıkacak Gece alacarte gece yemegi çok zayıf .👎Eğlence kismi ise idare eder seviyede gece saat 01:00 de hayat duruyor dicso filan var aslında var hemde güzel yerde  sahil kısmında açık havada ama dediğim gibi gece 01 de bitiyor bence büyük eksi.👎 iskele kisman da yapilan cuma gecesi dj ise cok iyiydi 👍 Bowling bilardo ps oyunlar ücretsiz  çocuklar güzel eyleniyor Bowling  barda çalışan Arda kardeşimin hazırladığı kokteyler ise şahane tebrik ediyorum .Bir tebrik te Çocuk Kids te Sevilay hanim a inanılmaz  ilgili clubta inanılmaz aktiveteler var ahşap ta ise Poyraz bey cok iyi isinde ilgi ve alakasi  mükemmel seramik, tshirt boyama vs . iyi bir seviyede oradaki bütün çalışanlar alkışı hak ediyor otelin tüm yükü bence onlar çekiyor zaten Kids club olmasa otel 5 üzerinden benden 2 yer ama suan benden 4 aldı:) oda sahil kısmı ve gece Eğlencesi az olduğu için  1 puan oradan kırdım bir daha gelirmiyim asla gelmem gelecek olanlar büyük beklenti içine girmez ise mutlu olurlar .Otel yönetime teşekkür ederim müşteri dinlerlerse  başarılı olurlar onun haricinde sadece mazide kalırlar...",
    "mainClasses": [
      "Amenities",
      "Location",
      "Room"
    ],
    "subClasses": [
      "Accessibility",
      "Beach",
      "Entertainment",
      "Noise"
    ],
    "sentiments": [
      "Negative",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Curiosity",
      "Gratitude",
      "Joy"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_117",
    "rating": 5,
    "date": "2025-09-07",
    "location": null,
    "country": "Unknown",
    "comment": "Das Hotel Titanic überzeugt mit modernen, sauberen Zimmern, hervorragendem Service, tollem Spa-Bereich und ausgezeichnetem Essen. Die zentrale Lage ist perfekt, und das Personal ist äußerst freundlich. Besonders der Restaurant Chef Herr Bülent Uzunel und der Herr Mustafa von der Gäste Betreuung waren sehr lieb und haben mir sehr weiter geholfen.",
    "mainClasses": [
      "Amenities",
      "Service"
    ],
    "subClasses": [
      "Spa",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Love"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_118",
    "rating": 5,
    "date": "2025-09-07",
    "location": null,
    "country": "Unknown",
    "comment": "Muhteşem bir otel herkese tafsiye ederim 20 yıldır her sene tatile gidiyorum ama tıtanıc gibi bir otel gibisini görmedim hem yemek hem ilgi hem dış görsel👌👌👌👌",
    "mainClasses": [
      "Food"
    ],
    "subClasses": [
      "Quality"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Food"
  },
  {
    "id": "review_119",
    "rating": 1,
    "date": "2025-09-06",
    "location": null,
    "country": "Unknown",
    "comment": "Konu: Tatilimizde Yaşadığımız Olumsuz Deneyim Hakkında Şikâyet Temmuz ayında otelinizde konakladık. Ancak ne yazık ki tatilimizin son gecesi yaşadığımız olaylar, tüm tatilimizi gölgeledi. A la carte restoranda yemek yedik, ertesi gün ödeme için resepsiyona çağrıldık. Eşim gittiğinde, 50–100 Euro gibi küçük bir fark olabileceğini, bunun teyit edilmesini ve gerekiyorsa ödemeyi yapabileceğimizi söyledi. Resepsiyondaki görevli de ödemeyi hemen almayacağını, kontrol edip geri döneceğini belirtti. Buna rağmen, herhangi bir bilgilendirme yapılmadan odamız kilitlenmiş. Ben 2 yaşındaki çocuğumu uyutmak için odaya çıktığımda kapıyı açamadım. İçeriden ses gelince odada birinin olabileceğinden korktum. Çocuğum ağlıyor, uyku saati gelmişti. Eşim o sırada nargile bölümündeydi, telefonumun şarjı da bitmişti. Çaresiz şekilde koridordaki telefonlardan resepsiyonu aradım, durumu anlattım ve güvenlik göndermelerini rica ettim. Ancak uzun süre kimse gelmedi. Tekrar aradığımda yine “bekleyin” denildi. Bu süreçte çocuğumla birlikte sıcak koridorda büyük bir stres yaşadım. Sonradan öğrendik ki odamız, “ödeme yapılmadı” gerekçesiyle kilitlenmiş. Ancak bu bize açıkça söylenmedi. Sanki farklı bir problem varmış gibi oyalandık. Eşim resepsiyona geldiğinde bile kendisine bilgi verilmedi. Doğal olarak sinirlenip tartışma yaşandı. Oysa ortada büyük bir rakam yoktu; ödeme yapmamak gibi bir niyetimiz hiç olamazdı. Arabamız otoparkta, milyonluk değeriyle dururken bize bu şekilde davranılması kabul edilemez. Gerçekten bir ödeme sorunu varsa, polis çağrılabilirdi. Ancak odamızın bizden habersiz kilitlenmesi ve küçük çocuğumla mağdur edilmem kesinlikle doğru bir uygulama değildir. Yaşanan bu olay nedeniyle büyük bir hayal kırıklığı yaşadık. Tatilimizi aceleyle sonlandırıp otelden ayrılmak zorunda kaldık. Eşim de öfkeyle parayı ödedi, ancak yanlış bir anlaşılma yüzünden hem psikolojik olarak yıprandık hem de rezil olduk. •\tOdamız bizden habersiz kilitlendi, •\tKüçük çocuğumla mağdur edildim, •\tEşim gereksiz bir gerginliğe sürüklendi, •\tTatilimiz zehir oldu. Prestijli bir otelde böyle bir durumun yaşanması bizi derinden üzdü. Bu olayda sorumluluğu olan kişilerin tespit edilmesini ve gerekli yaptırımların uygulanmasını talep ediyorum.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Bathroom",
      "Bed",
      "Entertainment",
      "Fees",
      "Front Desk",
      "Neighborhood",
      "Noise",
      "Overall Value",
      "Price",
      "Proximity to Attractions",
      "Restaurant",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral"
    ],
    "emotions": [
      "Annoyance",
      "Disappointment",
      "Disapproval",
      "Fear",
      "Neutral",
      "Optimism",
      "Sadness"
    ],
    "sentiment": "Negative",
    "category": "Amenities"
  },
  {
    "id": "review_120",
    "rating": 5,
    "date": "2025-09-06",
    "location": null,
    "country": "Unknown",
    "comment": "Öncelikle ilk girişte acaba mı dedikten sonra mükemmel bir hafta yaşadım özellikle çocuklu ailelerin kesinlikle düşünmeden seçebileceği bir otel biri 9 biri 3 yaşında 2 çocuğum var inanılmaz aktiveler var ve ikiside havuza girmek yerine kids clupta zaman geçirmek istedi Sevilay Hanım liderliğinde çok eğlendiler ve bizde çok rahat bir tatil geçirdik. Otel havuzu yeterli yemekleri muazzam herşeyi ile çok memnun kaldık.Sevilay hanıma çok teşekkür ederiz herşey için hiç gözümüz arkada kalmadı.",
    "mainClasses": [
      "Amenities"
    ],
    "subClasses": [
      "Entertainment",
      "Pool"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Gratitude",
      "Joy"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_121",
    "rating": 5,
    "date": "2025-09-06",
    "location": null,
    "country": "Unknown",
    "comment": "Everything was unreal from day one, have not 1 bad thing to say about the hotel. Staff were amazing and will deffo be back.",
    "mainClasses": [
      "Location",
      "Service"
    ],
    "subClasses": [
      "Proximity to Attractions",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Location"
  },
  {
    "id": "review_122",
    "rating": 5,
    "date": "2025-09-06",
    "location": null,
    "country": "Unknown",
    "comment": "Fantastic hotel, great facilities and plenty of delicious food! Pools are awesome, water park is great fun and there’s loads of stuff for kids (and adults) to do.",
    "mainClasses": [
      "Amenities"
    ],
    "subClasses": [
      "Entertainment"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_123",
    "rating": 5,
    "date": "2025-09-06",
    "location": null,
    "country": "Unknown",
    "comment": "Second time being here. Amazing cabana servise with Ruslan. He remember me and this is so nice. I will definitely come back. Thank you so much Merve from guest relations for all information and your conversation 🙏",
    "mainClasses": [
      "Location",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Proximity to Attractions",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Location"
  },
  {
    "id": "review_124",
    "rating": 5,
    "date": "2025-09-06",
    "location": null,
    "country": "Unknown",
    "comment": "The hotel is so clean. Staff friendly and very amazing. The roulerblade guy who has the name Yusuf amazing. Yesterday the guy working in Solaris bar he remembered us he is so nice. Enes from the olimpic bar he is great working very well. Thank so much Merve from guest relations she was nice and friendly",
    "mainClasses": [
      "Service",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Room Service",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_125",
    "rating": 5,
    "date": "2025-09-05",
    "location": null,
    "country": "Unknown",
    "comment": "Otel gerçekten beklediğimizden daha iyiydi. Eğlence açısından, yemek açısından ve temizlik açısından oldukça üst düzeydi. Ayrıca belirtmem gerekiyor ki saat fark etmeksizin Mustafa bey her sorunumuzla ilgilendi. Çok teşekkür ederiz Mustafa beye.",
    "mainClasses": [
      "Amenities",
      "Service"
    ],
    "subClasses": [
      "Entertainment",
      "Room Service",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_126",
    "rating": 3,
    "date": "2025-09-05",
    "location": null,
    "country": "Unknown",
    "comment": "Just returned from a 10 night stay at the Titanic, there was 14 of us ranging in age from 2-56. The hotel looks very grand and check in was easy, polite staff and our cases were taken to our rooms which is always a nice touch. The rooms are smaller than other 5* we have been to but do come with a mini bar, flat screen tv and Air Con(I’ll come back to that shortly) and the bed was nice and comfy. The pool areas are nice, kids pool and slides is great and there are bigger, quieter pools for those with no children. The floors around the pools are VERY slippy, very dangerous and we saw countless people falling. You can order drinks using the QR codes on the umbrella and your drinks come via “skater waiters” which is good, they work hard. Service at the bar is also good although drinks often come different each time depending on who serves you. We found the food ok, we ate most nights without issue but some of our party struggled and decided to either eat out or use the al la carte restaurants, they said the Asian was very nice but the Italian/greek were average. We found sitting in the 16+ area was much better, you can find a table to eat at easier and your drinks are served quicker,  but obviously those with younger children have to struggle amongst the crowds. Guests don’t help, lots of rude people pushing in or taking all the freshly cooked steaks! There’s a lack of toilets in the main buffet restaurant, if you are sat at the bottom and your child needs to go quickly you have to make your way all the way to the top entrance. Food in the other snack bars is decent although due to language barriers service is sometimes a struggle. Potato bar, waffle and ice cream bar both great, good selection. Kids area is great, large safe area for kids of all ages, we didn’t leave the children but I do think it would be safe too. Beach is good, always lots of loungers and the sea is lovely, again a toilet block would be handy but only a suggestion. On site shops are ok, we only bought bits and as expected it’s a little more expensive than heading to the other shops a short walk away. Once you get around the place you start to notice that the hotel is in need of a make over, cracked marble counters just fixed with sealant. Our bathroom ceiling needed a re-paint and our air conditioning decided each day if it wanted to work or not and we noticed a glass left near a lift for about 4/5 days running. Small things really that didn’t spoil our stay but for a 5* at the cost we paid it would put us off returning I’m afraid. There were issues that the hotel has little control over, some of the guest were just plain rude, running up and down corridors at 3am, slamming doors at all hours. It’s a shame but certainly not the Titanics fault. My main moan was an isolated incident where I ordered a round of drinks at a bar by the first pool, it was around 23:45 and I’d waited in line. The moment it turned 00:00 I was refused part of my order as the bar had closed! Ridiculous and very embarrassing for me returning with less drinks than required. I wouldn’t expect this anywhere let alone a 5* hotel having paid over £6000. We found the entertainment average, they try and it can’t be easy in the heat but it’s all things you’ve seen before and the seating area looks much larger on pictures. We did a boat trip which was great, staff were very good and we went to caves and waterfalls, would recommend this. Some also used jet skis which the kids enjoyed but it was expensive. The Dolphin swim a short walk away from the hotel was very expensive and not very well organised. On the whole we enjoyed our holiday, the Titanic is not a bad hotel it just needs an upgrade, we would return to Turkey but would probably return to the Trendy Lara a short distance away.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Bar",
      "Beach",
      "Entertainment",
      "Overall Value",
      "Pool",
      "Price",
      "Proximity to Attractions",
      "Quality",
      "Restaurant",
      "Room Service",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Annoyance",
      "Disappointment",
      "Disapproval",
      "Embarrassment",
      "Fear",
      "Joy",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_127",
    "rating": 5,
    "date": "2025-09-05",
    "location": null,
    "country": "Unknown",
    "comment": "Her şey çok güzeldi memnun kaldık ailece gidilebilecek otel. Oyun parkları, deniz, otel 5 yıldız. Oda temizlikleri de iyiydi",
    "mainClasses": [
      "Amenities"
    ],
    "subClasses": [
      "Entertainment"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Joy",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_128",
    "rating": 5,
    "date": "2025-09-05",
    "location": "Kilwinning, United Kingdom",
    "country": "United Kingdom",
    "comment": "Fantastic cabana services with Ahmet and Mustafa. That's way we come back here again. This hotel is so lovely and staff so friendly 😌😌😌😌😌 thank you Merve from guest relation for information and talking to us🥰🥰🥰",
    "mainClasses": [
      "Location",
      "Service"
    ],
    "subClasses": [
      "Proximity to Attractions",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Gratitude",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Location"
  },
  {
    "id": "review_129",
    "rating": 5,
    "date": "2025-09-05",
    "location": "Istanbul, Türkiye",
    "country": "Türkiye",
    "comment": "Otelden genel olarak memnun kaldık. Odalar, temizlik, sadelik anlamında beklentimizi karşılayan bir tatil oldu. Çalışanlar ilgili ve nazik.",
    "mainClasses": [
      "Amenities",
      "Location",
      "Service"
    ],
    "subClasses": [
      "Proximity to Attractions",
      "Spa",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Joy",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_130",
    "rating": 5,
    "date": "2025-09-04",
    "location": null,
    "country": "Unknown",
    "comment": "Her şey düşünülmüş mükemmel bir otel.çocuklar için özellikle çok fazla alternatif var.yemekler,temizlik,personellerin ilgisi hepsi çok iyiydi.çok güzel bir tatil geçirdik herkese tavsiye ederim.",
    "mainClasses": [
      "Amenities"
    ],
    "subClasses": [
      "Entertainment"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_131",
    "rating": 5,
    "date": "2025-09-04",
    "location": "Doncaster, United Kingdom",
    "country": "United Kingdom",
    "comment": "Fantastic hotel, entrainment is brilliant, cannot fault the food which is all really nice in all restaurant’s, pool areas are really good, staff are really friendly and cannot do enough for you, the beach area is really clean and relaxing. Overall the hotel is definitely one we will be coming back to as we have enjoyed it so much",
    "mainClasses": [
      "Amenities",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Joy"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_132",
    "rating": 5,
    "date": "2025-09-04",
    "location": null,
    "country": "Unknown",
    "comment": "This is our first experience at this wonderful hotel with fantastic staff entertainment and a range of food and drinks. Nothing is not too much trouble for them and we will definitely be returning as soon as we can.",
    "mainClasses": [
      "Location",
      "Service"
    ],
    "subClasses": [
      "Accessibility",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Location"
  },
  {
    "id": "review_133",
    "rating": 5,
    "date": "2025-09-04",
    "location": null,
    "country": "Unknown",
    "comment": "Ein sehr schöner Urlaub, sehr zufrieden mit dem Service und super leckeres Essen. Ein sehr kinderfreundliches Hotel.",
    "mainClasses": [
      "Service"
    ],
    "subClasses": [
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_134",
    "rating": 5,
    "date": "2025-09-04",
    "location": null,
    "country": "Unknown",
    "comment": "Auch perfekt für Familien mit Kindern. Kinder werden sehr gut betreut.",
    "mainClasses": [
      "Amenities",
      "Service"
    ],
    "subClasses": [
      "Entertainment",
      "Housekeeping"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_135",
    "rating": 5,
    "date": "2025-09-04",
    "location": null,
    "country": "Unknown",
    "comment": "10 day stay at this hotel, kids club amazing and so much to do for all ages. Cabana on the beach or pool 100% worth  it great service, staff are very friendly. Aziz served us on our last day, very friendly and nothing was too much bother!",
    "mainClasses": [
      "Amenities",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_136",
    "rating": 5,
    "date": "2025-09-04",
    "location": null,
    "country": "Unknown",
    "comment": "Staff very helpful and always smiling. Kids club is great and bowling bar🩷🩷✔️✔️✔️❤️❤️❤️❤️❤️❤️❤️🩷🩷🩷🩷",
    "mainClasses": [
      "Amenities",
      "Service"
    ],
    "subClasses": [
      "Entertainment",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Caring"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_137",
    "rating": 4,
    "date": "2025-09-03",
    "location": null,
    "country": "Unknown",
    "comment": "Great holiday but Unfortunately not a 5* Sorry for the long post. This is our 9th visit to lara beach but first time at titanic. We've always heard good things about the hotel in the past and firends have stayed here before so thought we would book as a last minute holiday. We travelled as 2 adults and 2 children. When we arrived we checked in and went to the room then went straight down to watch the fireworks. When we went back to the room our key cards didnt work. Bit of an inconvenience but quickly sorted. The rooms are fine as not alot of time spent in them, the pull out bed for our 11 year old and 8 year old was very small. The pillows are awful. Well stocked mini bar every day and was cleaned everyday with fresh towels. The morning breakfast doesn't start until 8am which I thought was a bit late as normally opens at 7am. Breakfast was nice enough but the pastrys were always a bit on the burnt side and stuck to the baking tray. Long que for omlettes. The sunbed situation at this hotel is a dampener on anyone's holiday! Its a joke and alot of sunbeds are reserved very early. We saw the towel police come round and remove towels which obviously caused a few arguments between the guests that originally put their towels down as they were not aware that they had been removed and thought people had just stole there sunbeds. Maybe they need to follow the Sunbed policy from other hotels like the delphins. The slides are excellent and the pools are lovely, clean and  refreshing. The Olympic pool we food too warm and hardly used it. The inside pool is freezing. The floors are deadly. We saw so many kids and adults fall over. I think they would benefit from some mats for people to walk on. Skaters Yousef and mustafa are the best and so friendly and helpful they couldn't do enough for you. A big thank you to osman the cleaner around the pool. He's a lovely guy, so friendly and is brilliant at keeping the areas clean. I bet he doesn't get enough praise from the management for what he does. The bars around the pool do not open until 10am. I think we occasionally could get bottled water but this is ridiculous seeing as people go down to the pool about 7 or 8. This is where the fridges would come in handy. The drinks are a disappointment for a 5* hotel. All the other hotels we have been to along lara beach have had fridges with bottles of water, cans of soft drinks, bottles beer etc that you can help yourself to. I think they would definitely benefit from the fridges throught the pool areas and hotel as it would take pressure off the waiters, bar areas nad prevent ques. This also applies to branded ice cream. This was a big disappointment as only scoop ice cream available unless you go to the kids club and they only offer a few random wrapped ice creams the freezer. Again this is the first hotel we have been to in lara beach that don't have the freezers to help yourself. The lunch restaurants down the beach are lovely. We never had a bad lunch in either of these, good choice and we always managed to find a seat. The service was really quick. I think the hotel needs a few snack areas with quick food as not everyone wants to go in the buffet for lunch or the two restaurants. After breakfast finishes there is nothing to snack on until the lunch opens. After lunch theres only waffles, Ice cream, fruit and jacket potatoes available until dinner. The Cabanas on the pier are brilliant, we booked this for my husbands birthday and enjoyed it so much we booked again during the week. They are expensive considering everything you get is available within the hotel but nice to have the waiter service and also the shade and breeze from the beach. We booked Cabana number 1 both times as we felt more comfortable with the kids being able to go down the stairs into the sea as it is deep. The guy we booked with at the beach Cabana reception was brilliant and so helpful (sorry I can't remember his name) We didnt try any of the al a carte restaurants which were extra. Again the other hotels we have stayed in allowed guests one visit per stay for free. The late restaurant after 11pm was good. We only visited here once for a quick snack and a good variety on the menu. The hotel was full and you could definitely notice this. We felt there were too many cabanas round the pool and if these were removed you could fit in many more single sunbeds. The hotel is very cramped with the amount if people and there are never any areas that feel less busy. I would say 90% are English guests which we have never really had at any of the other hotels. It was nice as we were able to speak to alot of other guests and hear there experiences. Alot have said the same as us. Also the English know how to que which is a good thing when it comes to the lifts. After being at the pool you had some randoms that do not understand that there is a que and push in. They were soon put in their place and sent to the back of the que by the English guests. The entertainment the first few days we were there was not brilliant. Towards the middle/end of the hotel it definitely got better. The titanic fest was brilliant and the kids loved it. It was very busy and I think the staff need to monitor the games etc as it was just a free for all with some kids not with their parents and just didnt want to get off when it was someone else's turn. The show on the Thursdsy night with the motorbikes (can't remember what it was called) was great. Everyone loved it and it was the best show we had seen. The food in the evening buffet was really nice. There was something for everyone. It was chaotic in the restaurant as no one wanted to sit outside in the heat to eat so everyone was trying to find tables inside. There was a few times we had to wait but the waiters were normally good at cleaning tables quickly. The kids club is probably the best we have seen. Our kids are a bit older but went in the soft play occasionally with some friends they met. Its lovely and cool in there. Some of the staff on the reception in the kids club were a bit miserable and didnt seem to want to be there. Others were lovely and made the kids feel very welcome. The hotel is in a good location and only a 5/10 min walk to the shops. When it came to checking out the man on reception asked if we was checking out which I said yes. All he said was room number, checked the system and asked for our room keys. No mention of \"did you have a nice holiday, was everything ok\" very miserable. We have had a great holiday. We had friends meet us out there half way through the holiday (they are still there) and met some lovely people that we will keep in touch with. Would we stay again? If it came up cheaper than some of the other hotels then maybe yes. This hotel is quite expensive compared to some other hotels we have been to and I wouldn't say the experiance was any better. I have mentioned another hotel chain previously and I think we always compare hotels to these as the experiance there was more than 5*. Titanic really needs to make some improvements and if these are made we would return. Overall we've had a great holiday, we don't regret booking this hotel and glad we had the experiance. We are just a bit disappointed to have paid the amount we did and was expecting more. A big thank you to yousef and mustafa the skaters round the pool and especially osman the cleaner by the pool. You were all amazing and definitely a credit to the hotel.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Beach",
      "Bed",
      "Breakfast",
      "Cleanliness",
      "Entertainment",
      "Neighborhood",
      "Noise",
      "Overall Value",
      "Parking",
      "Pool",
      "Price",
      "Proximity to Attractions",
      "Quality",
      "Restaurant",
      "Room Service",
      "Staff Attitude",
      "View"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Amusement",
      "Annoyance",
      "Approval",
      "Disappointment",
      "Disapproval",
      "Disgust",
      "Gratitude",
      "Joy",
      "Love",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_138",
    "rating": 5,
    "date": "2025-09-03",
    "location": null,
    "country": "Unknown",
    "comment": "Das Hotel ist top. die Strand Cabana sind super das Essen ist super das Personal ist super. Am meisten bevorzuge ist Herr Ergin von The Gastrelation und Herr ja Ahmet von der Strand, Cabarna und Emre von der Rezeption.",
    "mainClasses": [
      "Food",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Housekeeping",
      "Overall Value",
      "Restaurant"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Food"
  },
  {
    "id": "review_139",
    "rating": 4,
    "date": "2025-09-03",
    "location": null,
    "country": "Unknown",
    "comment": "We recently stayed at the Titanic Hotel for a week as a family with children aged 5, 14, and 17. Overall, it’s a large, clean, hotel with plenty of activities for all ages, which is a definite plus. The kids’ club was especially good while I didn’t leave my 5-year-old there unattended, we both enjoyed a daily visit, and the staff were welcoming and engaging. That said, there were a few disappointments, mainly around the à la carte restaurants, which come at an extra cost. We tried a few of them: •\tThe Italian Restaurant had a pleasant atmosphere and the food was decent, though the menu was quite limited. •\tThe Greek Night offered great entertainment and a fun vibe, but unfortunately, the food didn’t meet expectations. •\tThe Beef Restaurant was another miss in terms of variety, and while we ordered T-bone steaks, they arrived without any seasoning still edible, but lacking flavour. A particular issue we had involved our 5-year-old’s meal. We ordered just chicken nuggets and chips, but the dish came with spring rolls and other sides we said we didn't want. When I told the waiter we didn’t order those extras, he insisted that’s just how the meal comes. Eventually, he returned with only three nuggets and a plate of chips. I let it go at the time, but the next morning I spoke with hotel management not to dispute the cost, but to raise the principle of being charged €25 for such a basic kids meal. Unfortunately, the manager was not flexible and insisted we pay the full amount. One final note: my teenage son mentioned that a staff member offered to fill in a positive review on his phone on his behalf, and even took a photo of his screen after posting it. This felt uncomfortable and raised concerns about how reviews might be managed to balance out negative feedback. Overall, the hotel shows promise and offers several positives, particularly for families. However, there are areas that require improvement most notably in guest services and the value and quality of food provided in the à la carte dining experience.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Fees",
      "Neighborhood",
      "Overall Value",
      "Proximity to Attractions",
      "Restaurant",
      "Room Service",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Amusement",
      "Approval",
      "Disappointment",
      "Joy",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_140",
    "rating": 5,
    "date": "2025-09-03",
    "location": null,
    "country": "Unknown",
    "comment": "Second time here, returned as we loved it so much the first time round. 9 year old absolutely loved the kids club. Night time entertainment was brilliant (Michael Jackson) Only downside would be the smokers bit not the hotels fault. Wish there were designated smoking areas for those that smoke.",
    "mainClasses": [
      "Amenities",
      "Location",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Neighborhood",
      "Overall Value",
      "Proximity to Attractions"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Desire",
      "Love",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_141",
    "rating": 5,
    "date": "2025-09-03",
    "location": null,
    "country": "Unknown",
    "comment": "Excellent hotel \nFirst visit to titanic deluxe hotel and we were upgraded to a swim up pool room, the staff are very helpful and it is spotlessly clean",
    "mainClasses": [
      "Amenities"
    ],
    "subClasses": [
      "Pool"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_142",
    "rating": 5,
    "date": "2025-09-03",
    "location": null,
    "country": "Unknown",
    "comment": "Aziz beyin cabana servisinden çok memnun kaldık. Kendisine çok teşekkür ediyoruz 😎😎😎😎😎😎😎😎😎",
    "mainClasses": [
      "Amenities",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Gratitude",
      "Joy"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_143",
    "rating": 5,
    "date": "2025-09-02",
    "location": null,
    "country": "Unknown",
    "comment": "Ich komme seit 10 Jahren nach Antalya, ich war fast in jeder Ortschaft, soweit die ganze Riviera reicht jedoch kann ich das Hotel Titanic Deluxe in Lara empfehlen selbstverständlich sehr geeignet. Für Familie mit Kinder behindertengerecht Service ist exzellent Die Anlage ist so groß, dass man jeden Tag viele Animationen reichlich Essen was auch sehr schmeckt. Der Punkt Sicherheit ist hier sehr groß geschrieben.",
    "mainClasses": [
      "Amenities",
      "Location",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Neighborhood",
      "Overall Value"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Approval",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_144",
    "rating": 5,
    "date": "2025-09-02",
    "location": "Glasgow, United Kingdom",
    "country": "United Kingdom",
    "comment": "Perfect hotel with good entertainment. Especially darts with Angela. We love every shows in the evening and bbi extreme was so cool. White party with fireworks is amazing.",
    "mainClasses": [
      "Amenities",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_145",
    "rating": 5,
    "date": "2025-09-02",
    "location": null,
    "country": "Unknown",
    "comment": "Really nice  hotel, great staff, al a carte was great, the steak al a carte was first class. Plenty of food options. Very clean, pools are big and plenty of space, comfortable sunbeds.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Service"
    ],
    "subClasses": [
      "Pool",
      "Quality",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_146",
    "rating": 5,
    "date": "2025-08-30",
    "location": null,
    "country": "Unknown",
    "comment": "Memnun kaldık yemek içecek personel herzaman yanımızda güleryüzlü ve yardımseverdı özellikle misafir ilişkileri ve misafir ilişkilerinden Mustafa Bey e de ayrı teşekkür ederiz",
    "mainClasses": [
      "Service"
    ],
    "subClasses": [
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Gratitude"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_147",
    "rating": 4,
    "date": "2025-08-30",
    "location": null,
    "country": "Unknown",
    "comment": "I was expecting a 5 star holiday and we paid a lot of money for the holiday and I feel very disappointed. My child was given a free child place and however the room wasn’t big enough for us all as a family of 4 and room wasn’t as pictured when we booked. The children shared a small pull out bed and often we were only left 3 towels in the room. You can only use one restaurant per week stay, for the money we paid I feel like this is ridiculous, the supplement charge for the restaurants is a lot of money too. In the main restaurant the food was the same alot of the time and we would get ignored trying to get someone to clean a table so we could sit down. Around the pool the floors were slippy and I saw several children fall, and one in particular really hurt themselves. I do have a few positives. The slides were fantastic and the kids clubs/ entertainment was brilliant. I just feel like this hotel is advertised as 5 star and I would say it’s more 4 star.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Bed",
      "Entertainment",
      "Noise",
      "Overall Value",
      "Pool",
      "Price",
      "Restaurant",
      "Room Service"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Annoyance",
      "Approval",
      "Neutral",
      "Sadness"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_148",
    "rating": 5,
    "date": "2025-08-30",
    "location": null,
    "country": "Unknown",
    "comment": "Gerçekten çok memnun kaldığımız bir otel, yeniden restorasyon yapılan yerler var ve ilk gelişimizden daha da memnun kaldık. Hizmet güzel, yiyecekler kaliteli ve burayı 2. Tercih edişimiz ailece çok memnun kaldık.",
    "mainClasses": [
      "Amenities",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Joy"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_149",
    "rating": 3,
    "date": "2025-08-30",
    "location": "Liverpool, United Kingdom",
    "country": "United Kingdom",
    "comment": "Leaving today after ten days here , thought I would note the following which may help Pros:- \nPatisserie is amazing , unlimited cakes and ice creams etc which kept the kids (and adults) happy ! The buffet food is nice and definitly something for everyone but it is so busy and chaotic. Due to this it isn’t as clean around the dining areas as it should be and didn’t feel like a 5 star hotel. Smoking around the kids pool - I get it’s a habit for some but smoking around my kids wasn’t something I appreciated , blowing smoke over to us (not by the English guests, mainly European guests) A la Cartes are expensive to attend compared to other holidays - they are brilliant and staff are increíble but I feel this could be offered at a lower price considering how much we paid to come on holiday. There needs to be more options to experience more a la Carte places in my opinion for example the Trendy hotel offers all a la Cartes at least once for free Lifts - there needs to be many more lifts , we were lucky we were on floor one so only had two flights of stairs up and down to the pool but if you are on higher floors I can imagine it to be an annoyance and waiting for the lifts can be long On site shops - very expensive ! Go for a 5 minute walk outside the hotel and there are a lot of shops for much cheaper Games room - very old outdated equipment , needs to be updated as half the machines didn’t work. Not a lot of variety there. There is only 1 pool table in the entire hotel which with the amount of guests around made it impossible to have a go. The locals usually take it up for long periods. Rooms - the walls are very thin, we heard everything from next door for our entire trip - why people decide to re organise the room at 3 am I will never know but it made for an unsettled experience Food is plentiful and tasty I enjoyed every meal. The entertainment staff are amazing and so so talented the shows were brilliant and a real treat The cabana is a must we had one on the pier (cabana 4) and loved it. It was a great day only downside was the staff weren’t around for drink orders as much as I’d have hoped The steak a la carte is a must do experience the food was amazing and the service and atmosphere even better Overall I wouldn’t come back and would try another hotel , it definitely was a great holiday but too many negatives for us to pay the money to come back. We paid £4500 for the holiday plus about £600 in spends for 2 adults 1 child so for that , I would have expected a little more",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Entertainment",
      "Neighborhood",
      "Noise",
      "Overall Value",
      "Pool",
      "Price",
      "Proximity to Attractions",
      "Quality",
      "Restaurant",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Disappointment",
      "Disapproval",
      "Joy",
      "Love",
      "Neutral",
      "Optimism"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_150",
    "rating": 3,
    "date": "2025-08-29",
    "location": null,
    "country": "Unknown",
    "comment": "This hotel presents as a 5 star but I would say it’s a lower 4 at best. - Two of us got food poisoning on two separate occasions. - There’s flies everywhere in the restaurant, particularly over the fresh fruit which was left uncovered with no one manning the station . - The food was repetitive and cold. One item of food I bit in to actually felt half thawed. - Some of the serving staffs English wasn’t great at all, a lot of the drinks orders we made were wrong. - The sunbed issue was horrendous. We were down for 7am to find majority of them were taken. - A lot of the sunbed loungers were filthy and had scraps of food on them and dirt. - The only sugar free drinks they had on offer were Coke Zero and half the time they were flat because they were pouring them out of half used bottles. - Wasn’t impressed by the rooms for the price. - Having the mini bar was great.. until you come back to your room to find someone’s eaten the crisps and the chocolate bar (wasn’t any of us)\n- There was an awful smell around some of the free cabanas on the grass every single day. - We flew at 11pm so we paid the 30€ p/h for a room.. was taken down a dingey corridor in this small smelly room with rubbish air con and the windows didn’t open. We had ants under the wardrobe.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Bar",
      "Beach",
      "Bed",
      "Cleanliness",
      "Entertainment",
      "Noise",
      "Overall Value",
      "Proximity to Attractions",
      "Quality",
      "Restaurant",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Disapproval",
      "Disgust",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_151",
    "rating": 3,
    "date": "2025-08-28",
    "location": "Liverpool, United Kingdom",
    "country": "United Kingdom",
    "comment": "First time staying here at this hotel. Start with the negatives - \n* If you want a sun lounger be up before 6am as they don’t remove any towels unsupervised like they say they do \n* food very repetitive - breakfast, lunch and dinner. You also have to wait to be served your drinks and is very difficult when you want a 2nd drink, as they don’t bother to come over again. * children’s food is the same every single lunch and teatime (everyday)\n* entertainment- awful and thumping all night until at least midnight! If you have young children like myself then you won’t be getting any sleep before then. * music is that loud of a night you cannot talk to the person next to you without shouting at the top of your voice \n* shops inside hotel are very very expensive - don't buy from here \n* floors outside are slippery - seen a lot of people fall over - very dangerous \n* flies constantly at the dinner table and is very annoying when trying to eat\n* jacuzzi in the indoor pool doesn’t work \n* cats that have had kittens - roaming around outside and indoors \n* air conditioning in the room is not very good Now the positives - \n* room is cleaned & mini bar topped up \n* kids club - excellent \n* shops not far from hotel - nice walk away from the loud, thumping music!! We paid a lot of money to come here. Would we come back definitely NOT! Is it a 5* definitely NOT! Some staff are friendly and polite and others just don’t want to be there, which reflects in their attitude.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Breakfast",
      "Entertainment",
      "Overall Value",
      "Pool",
      "Restaurant",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Annoyance",
      "Caring",
      "Disapproval",
      "Disgust",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_152",
    "rating": 5,
    "date": "2025-08-28",
    "location": "Preston, United Kingdom",
    "country": "United Kingdom",
    "comment": "Gül is a fantastic artist and really helpful with the children. We would also like to thanks Azra (little) for being so lovely with our youngest and Ramazan for working tirelessly keeping kids club so clean. Mine - thank you for keeping everyone fed. And thank you all and the rest of the staff for making our children feel so at home and helping enjoy their holiday to the maximum.",
    "mainClasses": [
      "Food",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Quality",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude"
    ],
    "sentiment": "Positive",
    "category": "Food"
  },
  {
    "id": "review_153",
    "rating": 5,
    "date": "2025-08-28",
    "location": "Preston, United Kingdom",
    "country": "United Kingdom",
    "comment": "We're thoroughly impressed with the Kuala Kids Club! As parents of a nearly 2-year-old and a 5-year-old, we were hesitant to leave them but the facilities and staff quickly put our minds at ease. Each room is well-equipped, and the staff do an outstanding job of monitoring, engaging, and ensuring the children's safety and cleanliness. The entire team is friendly, smiley, and enthusiastic. Special mention goes to Kevser, who truly stood out. Her infectious happiness and passion for her role are evident in everything she does. She's a credit to the kids club, and we're grateful for the wonderful care she provided. Overall, we highly recommend the Kuala Kids Club for its exceptional facilities, outstanding staff, and warm, welcoming atmosphere.",
    "mainClasses": [
      "Amenities",
      "Room",
      "Value"
    ],
    "subClasses": [
      "Cleanliness",
      "Entertainment",
      "Overall Value",
      "Pool"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Joy",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_154",
    "rating": 5,
    "date": "2025-08-28",
    "location": null,
    "country": "Unknown",
    "comment": "Stunning hotel, great staff & beautiful food. The cabanas are excellent & everyone works hard to please! Couldn’t ask for more, thank you, can’t wait to return again.",
    "mainClasses": [
      "Amenities",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_155",
    "rating": 5,
    "date": "2025-08-28",
    "location": "Stokesley, United Kingdom",
    "country": "United Kingdom",
    "comment": "Brilliant in every way. Nothing was to much trouble. We have a decided to come back next year. I can’t think of a negative to report",
    "mainClasses": [
      "Location",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Proximity to Attractions"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Location"
  },
  {
    "id": "review_156",
    "rating": 5,
    "date": "2025-08-28",
    "location": null,
    "country": "Unknown",
    "comment": "This hotel is exceptional! It’s aesthetically pleasing, food and drinks are all great (which is rare in all inclusive). Entertainment is unmatched, the staff are all super helpful and kind. Eyup and mustafa were especially good they made our experience that bit better so thank you for a great holiday 🙏❤️",
    "mainClasses": [
      "Food",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Quality"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Food"
  },
  {
    "id": "review_157",
    "rating": 4,
    "date": "2025-08-27",
    "location": null,
    "country": "Unknown",
    "comment": "We stayed at the Titanic Deluxe Lara in August for our summer holiday. As many people will know, this is not a cheap hotel, so we arrived with fairly high expectations. First Impressions\nThe hotel certainly delivers on arrival – the reception area looks stunning, and the signature scents in the lobby create a luxury feel. We arrived at 2am and really appreciated the 24-hour snack bar, which meant we could grab a drink and a light bite before heading to bed. Pools & Sunbeds\nThe pool areas and water slides are a big highlight, especially for families. We’d heard stories of people reserving loungers from 5am, but in truth, we never struggled to find sunbeds. One drawback is how slippery the pool areas are – we saw a number of people fall (including waiters carrying trays of glasses), and unfortunately some quite nasty accidents. Food & Drink\nThe drinks offering is excellent, with proper branded options that you don’t always see in all-inclusive hotels. Fresh fruit, waffles, and snacks are plentiful throughout the day. The buffet restaurant serves good quality food, though it does become repetitive over a two-week stay. The à la carte restaurants come at an extra cost unless you book through Jet2, and while the food is nice, the menus are very limited. For example, the steakhouse only serves steak, which left my wife (a non-steak eater) with no option other than ordering separately from the Italian. Service & Cleanliness\nService in the main buffet restaurant was disappointing – tables were often left uncleared for long periods, drinks service was slow, and on several occasions we had to wait 10 minutes or more for a table to be wiped before we could sit down. Cleanliness overall is fine, but not at the standard you’d expect of a 5* hotel. Some areas would benefit from modernisation and a general refresh. Kids Club\nOn the positive side, the kids club is by far the best we have ever seen. It is extremely safe and offers unique activities such as music rooms, arts and crafts, and even t-shirt making. For families with children, this is a real standout feature. Entertainment\nEvening entertainment was a mixed bag. Many of the shows felt repetitive, with dance groups performing the same routines. The Michael Jackson tribute was excellent, but overall, more variety is needed. The live bands in the main square were enjoyable but far too loud – it was difficult to relax or chat, and if your room overlooks the square, you’ll struggle to sleep before midnight. •\tThe coffee shop is a great touch, serving excellent drinks and cakes, though it only stays open until midday – it would be even better if it ran later into the afternoon. •\tThe scuba diving team were brilliant, very professional and helpful. •\tThe poolside towel lady is one of the friendliest and most smiley people we’ve ever met – she really stood out, and we’d encourage guests to tip her well. •\tThe private cabanas are nice, though they need some attention. Avoid Cabana 9 by the pool – the constant banging of the rope made it anything but relaxing. Overall\nTitanic Deluxe Lara is a good hotel with plenty of positives, but it doesn’t quite justify the price we paid. With stronger service, more variety in food and entertainment, and some upgrades to facilities, it could be excellent. For us, hotels such as Delphin Palace currently offer better overall value in Lara.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Bar",
      "Entertainment",
      "Overall Value",
      "Pool",
      "Price",
      "Proximity to Attractions",
      "Quality",
      "Restaurant",
      "Sea View",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Approval",
      "Joy",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_158",
    "rating": 3,
    "date": "2025-08-27",
    "location": "Whitehaven, United Kingdom",
    "country": "United Kingdom",
    "comment": "So as I write this I am in the airport waiting to go home, whilst everything is fresh in my mind. Just to preface, we are a family of 4 (2 boys, 10&6) who came for 11 nights in the hight of summer and it cost us £5,800. Prior to travelling, everyone who I spoke to put this place on a pedestal and raved about how this was the best place they've ever been to, so expectations were made. To breakdown our experience; The room was very clean and tidy, small but enough space. I wasn't personally keen on the configuration, making the boys share a double bed. I did t say anything to the front desk and we made it work. The first two nights we left it as it was and the boys actually fell out of bed. I pushed the bed against the bathroom wall and put the boys pillows against the wall amazing a wider bed. Our bed was exactly the same and found the bed a bit firm and small for us, the pillows were poor, as a result our sleep wasn't great. Id say 4/5 for room as I didn't actually complain about it to the staff. Pools were absolutely fine, I have no issues with the outdoor pools. The ocean pool was where we spent the majority of our time as it wasn't too deep for our kids. We spent some time in the Olympic pool too again it was absolutely fine, same as ocean but just deeper. There was always beds within the first 2 rows around the olympic pool, the sunbeds weren't a problem here. We tried the indoor pool one day just so we had tried it, it was freezing and the jacuzzi didn't work. Score wise for the outdoor pools 5/5. Indoor pool 1/5 (but you probably won't want this on a summer holiday) Coming from a coastal town, we aren't interested in the beach really. Looking down the beach, it was clear, clean and spacious. The actual sand space isn't a lot as it's mainly shilly once you get away from the waters edge. We aren't beach lovers but would score it a 4/5. We're fortunate enough to be able to afford a pool cabanna 8 out of our 11 days. Can't lie, at €1200, it was expensive and on the whole, it was 100% worth it, you can have a lie in and not do sunbed wars, have drinks and food brought to you and you have a mini fridge on tap. However on our first day, we were in Cabanna 9 and a Turkish family tried to sit between cabannas 9 and 10. When I tried explaining that the two families in these cabannas had paid €300 combined for this area, they got very aggressive and tried to start a fight. When I called the Cabanna manager on the day (Sunday) he spent ages talking to the man and tried to money him. Eventually they actually gave them a Cabanna for free for that afternoon. Even after that, they tried to come back and cause more trouble. I tried to complain to guest relations and I was told \"it's a guest issue\" and nothing to do with the hotel and they would not even compensate me for the troubles. However when the usual manager, Hüseyin, returned on the Monday (He worked Monday to Saturday) it experience was brilliant. That first Sunday was a 1/5. After that it was 5/5 well worth it. The entertainment had potential, however there was far too many gaps for interpretative dance. The dancing was poor. My boys got very bored, very quick. The separated kids entertainment and adults entertainment was a low light for me. I enjoy watching the kids make a fool of themselves before the main attraction. Even being sat in Solaris Square, the bands and singers were too loud, you couldn't have a chilled conversation with friends. You were constantly shouting. Daytime entertainment isn't very well advertised however I enjoyed the water polo and the football. A fair rating of this is about 2/5. As to be expected whenever you visit Turkey, there is no bacon. This being said, once you expect it, you get over it. What was poor was the selection, it was the same items for breakfast and dinner, evening meal was on a 3 day rotation. Breakfast was fine there, however I got very fed up of the same items and by days 9, 10 and 11 I resorted to cereal for a change. That was even poor as there was no cold milk. So dinner was a funny one as we did not try the main resteraunt and stuck to the two main cuisines by the beach. The grill and the Italian were very nice and I'd recommend those. The waffle stand and the ice creams were stand out by far, particularly for our children. They recommend a waffle with chocolate sauce, chocolate chips and strawberrys. As stated very repetitive. However as steak lovers, me and my eldest loved every 3rd day when they grilled steaks. All cakes were delicious and we had no issues finding something we liked. We ALL enjoyed the slides, whilst the novelty was there, for the first two days we were doing the bigger slides. We created a game of 'who can soak the second row of sun loungers infront'. That is also a big tip. Don't sit on the first row of sun loungers unfront of the big slides. Both my children needed a wristband where I needed to sign a waiver, a fact I don't mind but I don't see the point for the older children, the water isn't that deep. Pirate island is mainly for little children and my youngest really seemed to enjoy it. Being honest after the first 3 days, my children weren't phased by it but it was good to go and spend half an hour here and there. The hotel itself was large and clean with lots of staff. The hotel shops are very costly and I would avoid at all times. The walk up to the blue bridge and the shops further down the strip will save you a minimum of 50% before haggling. After the entertainment, you will be waiting a minimum of 20 minutes just for a lift to your floor. The lifts are terrible. Every single day there is lifts going to floors but they're too full to get in. Be prepared to hit every floor on your way to breakfast/pool/meals or even back to your room. Also don't expect any decorum from the Turkish Nationals or the former Soviets, they are absolutely rude and will push into you, jump the ques and even blatantly stare at you while they do it. Being fair all the points I've raised didn't spoil our holiday. I just can't understand why people put this hotel on the pedestal when there are so many hotels in Lara beach. I would advise to try the delphin imperial as it looks much bigger and the splash park looks better (we seen this from a boat trip, we were able to see all the hotels on the strip.) I believe a 3/5 is very fair as it wasn't a bad holiday, but I wouldn't return.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Bed",
      "Breakfast",
      "Cleanliness",
      "Entertainment",
      "Front Desk",
      "Neighborhood",
      "Overall Value",
      "Pool",
      "Price",
      "Proximity to Attractions",
      "Quality",
      "Restaurant",
      "Sea View",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Amusement",
      "Annoyance",
      "Approval",
      "Confusion",
      "Disapproval",
      "Joy",
      "Love",
      "Neutral",
      "Optimism",
      "Sadness"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_159",
    "rating": 3,
    "date": "2025-08-26",
    "location": null,
    "country": "Unknown",
    "comment": "in my opinion this is not a 5* hotel. Pool staff were amazing and very attentive when supplying drinks\nThe pool areas and beach cabanas were lovely and sun loungers were very comfortable. Slides were good for the kids and the kids club was excellent \nSnack bars were really good but wpuld have been better to have more variety. The grounds were 5* but the hotel let it down Negatives\nThe hotel is dated. It looks like you are being transported to 1982. The restaurant dining area looks like we are in 1970s - the decor inside lets down this hotel\nThe glass on the front of the hotel was smashed and not replaced\nThe rooms are terrible. Very outdated and have no space at all. One wardrobe with 4 hangers and 2 drawers for a family of 4 is not acceptable. They are tiny rooms too. I complained to front of house staff and they were unhelpful and rude. I was told that we would receive some anniversary gifts of fruit and wine. We never got them. We had to ask for them.. why they couldn't provide them is beyond me. The food in buffet is terrible. Same old food day in and day out. They change the main meat daily but the rest of the food is the same. If you eat there for lunch and dinner you probably see the same stuff the next day too\nWe ate carefully.. my son is sick and I had tummy ache most days The beach restuarants were much better but the same menu which gets boring . My main bug bear was that everything was extra. Pool cabanas - EXTRA\nrestaurants Extra\nSilly little kids go carts 15 eur for 30 mins\nYou pay a lot of money to go and we spent 1000 more just to get away from the buffet . If you aren't someone who likes food and nice bedrooms then this place is for you The grounds and entertainment were really good Night time entertainment was awful- my 8 year old assembly at school was better",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Bed",
      "Entertainment",
      "Housekeeping",
      "Neighborhood",
      "Noise",
      "Overall Value",
      "Pool",
      "Proximity to Attractions",
      "Quality",
      "Restaurant"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Annoyance",
      "Caring",
      "Disappointment",
      "Disapproval",
      "Disgust",
      "Fear",
      "Neutral",
      "Sadness"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_160",
    "rating": 5,
    "date": "2025-08-25",
    "location": "Manchester, United Kingdom",
    "country": "United Kingdom",
    "comment": "Perfect hotel we had a lovely time with my family. The water slides the best thing in this hotel. We have been in Turkey before but didn't seen perfect hotel like this. Today we are leaving I am sure we will be comeback l",
    "mainClasses": [
      "Amenities",
      "Location",
      "Service"
    ],
    "subClasses": [
      "Entertainment",
      "Proximity to Attractions",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Disapproval",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_161",
    "rating": 5,
    "date": "2025-08-24",
    "location": null,
    "country": "Unknown",
    "comment": "Aziz is very good with pool cabana services he has been excellent. And definitely recommend anybody to try this out🍺🥂🤩🙌",
    "mainClasses": [
      "Amenities",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Pool"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_162",
    "rating": 4,
    "date": "2025-08-23",
    "location": null,
    "country": "Unknown",
    "comment": "2025 Ağustos ayında gittiğimiz Titanic Lara dan memnun ayrıldık. Yemekleri az çeşit olmasına rağmen lezzetli ve hijyenikti. Tatlıları çeşitli ve güzeldi. Yeme içme ile ilgili en kötü yanı çayları çok kötüydü. Barları her alandan ulaşılabilir ve hizmetleri iyiydi. Garsonlar her alanda güleryüzlü ve hızlıydı. Gece eğlenceleri ve kahvaltı saatleri bize göre  daha erken olsa iyi olacaktı. Çocuklu aileler için saatleri geç idi. Gün içindeki aktiviteler fazlaydı ancak alan geniş olduğu için katılım sağlamak zordu. Çocuk kulübü tüm çalışanları ile çok yardımsever be güler yüzlüydü. Özellikle çocuklu aileler için çocuk kulübü geniş ve eğlenceli. Havuzları  her yaş grubuna uygun olarak mevcut ve genişti ancak Aquapark kalabalıktan dolayı çabuk kirleniyordu. Otelin genel temizliği iyiydi. Oda temizliğimiz düzenli olarak yapıldı. Oda temizliğinden sorumlu Kamile hanım çok ilgili ve yardımseverdi. Genel olarak çocuklarda biz de memnun kaldık.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Bathroom",
      "Cleanliness",
      "Entertainment",
      "Housekeeping",
      "Overall Value",
      "Pool",
      "Proximity to Attractions",
      "Quality",
      "Restaurant",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Amusement",
      "Approval",
      "Disapproval",
      "Disgust",
      "Joy",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_163",
    "rating": 3,
    "date": "2025-08-23",
    "location": "Workington, United Kingdom",
    "country": "United Kingdom",
    "comment": "We as a family of 9 have just returned from the Titanic for the second time. The first time was last year and we were so impressed we returned this year. However, we won’t be returning as the hotel has deteriorated over the past 12 months. Massive complex, incredibly spacious hotel with plenty of open spaces and really nice grounds. Pools are huge and the water slides are really good. The all inclusive drinks are branded and imported. Snacks being available pretty much all day. Beach cabana’s are amazing. Had a couple days on them and it was worth it. Cabana waiters and the odd bar waiter are really good and work hard. However, the majority just can’t be bothered and don’t seem interested. The pool areas are treacherous when wet. My mother slipped upon getting there and walking to the room. We also witnessed multiple people slipping almost on an hourly basis, with one lady requiring a hospital visit and CT Scan. Guest relations informed us that they put out wet floor signs!!!! I’m sorry, that is a warning, it’s not addressing the very dangerous problem. The pool cabana’s are not worth the cost. They are the same price as the beach cabanas. The pool ones are smaller, require maintenance and ours was infested with ants after moving a pillow. Food had not been cleaned up from the previous day. Guest relations did not believe us and claimed we had dropped food. Staff, most are not interested. The room we had, family block was dirty and the floors were never cleaned. It would turn white socks black and if you didn’t wear the provided slippers, your bare feet would be black too. Food and food hygiene, this was nowhere near as good as last year. We all had stomach issues with one of us having mild food poisoning for 3 days after visiting the Italian a la carte. It was either a DJ playing awful, repetitive house music (ghostbusters remix I kid you not) or a poor show in the amphitheater. The MJ show was good but that was all. The Temu version of The Little Mermaid was horrendous. It was more suited to 5 years olds than families. They don’t take our feedback seriously and accused us of fabricating some of the issues as we don’t bring any of it up earlier in our holiday. The reply to this review will be interesting, as they do not like negative feedback. If you place your own towels out before 7am and leave, they will be removed by pool staff. If you place the hotel supplies towels before 8am and leave, they will be removed. However, if you speak Turkish, and tip the pool staff, they will place your towels out for you early in the morning. This caused a major uproar one morning, as the British families did not stand for this and removed them!! On the whole, we had a good holiday with the family, but I would not return to the Titanic again. It’s not a patch on last year.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Beach",
      "Entertainment",
      "Neighborhood",
      "Noise",
      "Overall Value",
      "Pool",
      "Proximity to Attractions",
      "Quality",
      "Restaurant",
      "Room Service",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Disappointment",
      "Disapproval",
      "Disgust",
      "Neutral",
      "Remorse"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_164",
    "rating": 4,
    "date": "2025-08-22",
    "location": null,
    "country": "Unknown",
    "comment": "An impressive looking hotel,  let down by some of the staff, the reception team were miserable, the girls in the buffet restaurant were rude, with that said, Angela from the entertainments team was exceptional, darts was a highlight of our sons day, Yosuf was exceptional too, always topping up our drinks on a evening in the Solaris square. I echo the previous comments about the pool side feeling unsafe, me being one of many guests that slipped & hurt my hip. Another downside was the branded drinks or should I say the lack of them. The shop prices were outrageously high and the guy in there was a misery. The hotel itself looked tired in places but on the whole  clean. We stayed in a family suite overlooking the pool, trying to get a sun-bed here was a no go! People reserving beds from 6am was an issue so unless alarms were set and you stayed with your sunbed early doors, you missed out, this was becoming a bigger issue a few days before we left whereby towels were removed which then caused conflict amongst guests which wasn’t necessary! On the whole we had a great 12 days here, but would we return, no, if you want to experience outstanding customer service, go to Ella excellence in Belek.",
    "mainClasses": [
      "Amenities",
      "Location",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Front Desk",
      "Overall Value",
      "Pool",
      "Price",
      "Proximity to Attractions",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Annoyance",
      "Disappointment",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_165",
    "rating": 5,
    "date": "2025-08-22",
    "location": "Ankara, Türkiye",
    "country": "Türkiye",
    "comment": "Titanic otele defalarca geldim ve gelmeye devam edeceğim. Otel çalışanları çok iyi burada ki herkes aile gibi herkese bu güzel hizmeti için teşekkür ederim",
    "mainClasses": [
      "Location",
      "Service"
    ],
    "subClasses": [
      "Proximity to Attractions",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Gratitude",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Location"
  },
  {
    "id": "review_166",
    "rating": 3,
    "date": "2025-08-22",
    "location": "Canterbury, United Kingdom",
    "country": "United Kingdom",
    "comment": "Nice but not 5 star, too much cost cutting. For families go to the delphin be grand hotel next door. Like: staff members very helpful and polite, hotel is immaculate, very clean, new children's club facilities (soft play, drawing, Lego, computer games), food was ok (no variety-see later), water slides for children Dislike: small rooms (family of 4), food was the same at lunch/dinner and everyday (if you like meatball burger you have come to the right place), the most limited gluten free selection I have ever seen, nowhere to get ice lollies, all swimming pools 1.4m or deeper so not good for children who are trying to learn how to swim, slides are good but kids got bored quickly",
    "mainClasses": [
      "Amenities",
      "Location",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Neighborhood",
      "Pool",
      "Price"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_167",
    "rating": 5,
    "date": "2025-08-22",
    "location": null,
    "country": "Unknown",
    "comment": "We stayed in this hotel almost 2 weeks and we were very happy, specially I have a 5 years old son who couldn’t swim before but we took a private lesson with Soulayman and after 4 session my little one is now swimming very well and we are very happy with that. In fact the sport club was very organized and responsive and for sure I highly recommended.",
    "mainClasses": [
      "Location",
      "Service"
    ],
    "subClasses": [
      "Accessibility",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Joy"
    ],
    "sentiment": "Positive",
    "category": "Location"
  },
  {
    "id": "review_168",
    "rating": 4,
    "date": "2025-08-21",
    "location": null,
    "country": "Unknown",
    "comment": "An honest review, family of four. The reception team are so miserable which really put us off when we first arrived. Yes the rooms are tight but we were hardly in them so didn’t bother us, our cleaning lady was lovely! The food was repetitive and needs more kids selection like pizza, plain cheesy pasta nuggets ect \nBut I think there should be a hotdog/burger place near the pools like the other hotels we’ve been to so you don’t have to go to the main restaurant!! Wow, the sun beds are a real issue, one morning we found sunbeds which the staff took the previous towels off because they reserved them which isn’t allowed and the family was so angry and thrown hot coffee over my husband missing my five year old, put a real damper on the rest of the holiday as nothing was done about the family all we was advised was to call the police. Wear pool shoes as the amount of people that slipped over was unbelievable. The hotel shop is way over priced and shouldn’t be allowed, if you want stuff travel over the blue bridge to migros supermarket! By far the best entertainment we’ve been to, was incredible! The coffee hut is such a lovely touch and was welcomed on all the mornings but would be good if opened at 7am! The shower and waiting lounge for late check out was a welcomed sight for us to get ready for our evening flight! Most of the staff was amazing and we really did enjoy our holiday we would definitely come back!",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Cleanliness",
      "Entertainment",
      "Overall Value",
      "Pool",
      "Proximity to Attractions",
      "Restaurant",
      "Spa",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Annoyance",
      "Excitement",
      "Neutral",
      "Sadness"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_169",
    "rating": 5,
    "date": "2025-08-21",
    "location": "Glossop, United Kingdom",
    "country": "United Kingdom",
    "comment": "Amazing hotel, service was fantastic Ruslan was a great host all day in the cabanas. Staff are really attentive. The children loved the pools.",
    "mainClasses": [
      "Amenities",
      "Service"
    ],
    "subClasses": [
      "Pool",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Love"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_170",
    "rating": 5,
    "date": "2025-08-21",
    "location": null,
    "country": "Unknown",
    "comment": "Het was helemaal geweldig! De service bij cabana nr.4 met Ruslan was meer dan perfect. 👍\nThank you so much!",
    "mainClasses": [
      "Amenities",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Pool"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral",
      "Surprise"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_171",
    "rating": 5,
    "date": "2025-08-21",
    "location": null,
    "country": "Unknown",
    "comment": "5 starts so far, our first time at the hotel and cannot complain. Food, drinks and snacks and staff all amazing.2",
    "mainClasses": [
      "Location",
      "Service"
    ],
    "subClasses": [
      "Accessibility",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Location"
  },
  {
    "id": "review_172",
    "rating": 5,
    "date": "2025-08-20",
    "location": "Leeds, United Kingdom",
    "country": "United Kingdom",
    "comment": "A great family hotel with lots of fabulous facilities for the kids, including the water slides and the kids club. Would definitely recommend to others!",
    "mainClasses": [
      "Amenities",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_173",
    "rating": 5,
    "date": "2025-08-20",
    "location": null,
    "country": "Unknown",
    "comment": "Good Service, clean Hotel.. Big swimming Pool area and kids area. Bowling for free - 30 Minutes per day. Service also at Pool.",
    "mainClasses": [
      "Amenities",
      "Service"
    ],
    "subClasses": [
      "Entertainment",
      "Pool",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_174",
    "rating": 1,
    "date": "2025-08-18",
    "location": null,
    "country": "Unknown",
    "comment": "We’ve stayed at other Titanic hotels before and always had great experiences, but this visit to Titanic Deluxe Lara was really disappointing. The pool areas didn’t feel safe — the tiles were very slippery, and we saw several guests (adults and children) slip and fall during our stay. We didn’t see any rubber matting or regular mopping around the pools, which you’d expect from a resort of this level. Our 7-year-old son ended up with a cut on the bottom of his foot from something sharp in the kids’ pool. He was seen by the doctor and advised not to use the water facilities, which sadly impacted the rest of the trip for all of us. We reported the issue at the time, but no one followed up or offered any real support during the remainder of our stay. This wasn’t the experience we hoped for — and definitely not what we’ve come to expect from the Titanic chain.",
    "mainClasses": [
      "Amenities",
      "Location",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Neighborhood",
      "Overall Value",
      "Pool",
      "Proximity to Attractions"
    ],
    "sentiments": [
      "Negative",
      "Neutral"
    ],
    "emotions": [
      "Disappointment",
      "Neutral",
      "Sadness"
    ],
    "sentiment": "Negative",
    "category": "Amenities"
  },
  {
    "id": "review_175",
    "rating": 5,
    "date": "2025-08-18",
    "location": "Barnstaple, United Kingdom",
    "country": "United Kingdom",
    "comment": "Best hotel in lara beach. Food and service very good. Kids club is the best in the world. Thank you for Merve from guest relation.",
    "mainClasses": [
      "Service",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_176",
    "rating": 5,
    "date": "2025-08-18",
    "location": "Carlisle, United Kingdom",
    "country": "United Kingdom",
    "comment": "Amazing hotel, fantastic staff, facilities and food. Yusaf was fantastic around the pool constantly topping our drinks up. We would definitely come again. We have had a great holiday and our son loved kids club",
    "mainClasses": [
      "Amenities",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value",
      "Pool"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Joy",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_177",
    "rating": 5,
    "date": "2025-08-18",
    "location": null,
    "country": "Unknown",
    "comment": "The trip has been amazing from start to finish. Mustafa at Pier Cabana was amazing. Good fantastic and facilities are excellent.",
    "mainClasses": [
      "Amenities",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value",
      "Pool"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_178",
    "rating": 5,
    "date": "2025-08-18",
    "location": "Stanwix, United Kingdom",
    "country": "United Kingdom",
    "comment": "So good hotel and entertainment is good. Angela from darts is so amazing person. She always knows how to make good contact with every one. All evening shows we like and was interesting and especially pool party",
    "mainClasses": [
      "Amenities",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Approval",
      "Joy"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_179",
    "rating": 3,
    "date": "2025-08-17",
    "location": null,
    "country": "Unknown",
    "comment": "So disappointed with our stay. We had read so many great reviews about this hotel and were really looking forward to our stay. Like everyone, we have worked hard all year to pay for this holiday and have been so underwhelmed. Firstly - the rooms. Very dated and in need of a revamp. There isn’t a great deal of storage space for belongings. Hair dryer is dated. No iron in room which is an inconvenience. The shower drains clearly weren’t cleaned or cleared before our stay as the first time we had a shower it was overfilling. We really didn’t feel the rooms were immaculately clean. Our bedding was also stained on arrival and when reporting it to reception, although fresh linen was sent up, there was no apology, nor did they offer to make the bed up for us. We were simply handed the bed linen. Not really 5* treatment if you ask me. Secondly - the food. As a party of 10, there wasn’t one adult that was overly satisfied. The main restaurant was SO repetitive and the food was very poor. There doesn’t seem to be themed nights like there are in most all inclusive hotels, so I don’t think this helped the variation. I totally appreciate that food in all inclusive resorts will get a bit samey after a week, but it seemed that it was the same dishes for lunch and dinner with very little change. The other issue is that no member of staff shows you to a table, so when you go to the restaurant at peak times it can be impossible to find a table. Furthermore, we would often be sitting for a length of time before we could flag down a waitress to ask for drinks and cutlery. The main dining area had no atmosphere and was more like a big canteen. It just wasn’t a nice experience. Seating and walls were in need of touch ups. This is the first hotel I’ve been to that I’ve actually dreaded going to eat. We did eat in the Italian Al A Carte which was slightly better and the service was much better there. That brings me to my next point, the staff. We have not had a great experience with the staff in this hotel. The majority of them pass you without even acknowledging you, never mind saying “hello” or “good morning”. We found most staff extremely rude and unbothered - particularly in the main restaurant. When we raised these issues with guest relations we genuinely didn’t feel they cared and no compensation was offered. My partner pushed for a complementary Al A carte which was then agreed. We will not return and I do not recommend.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Cleanliness",
      "Entertainment",
      "Fees",
      "Gym",
      "Noise",
      "Overall Value",
      "Proximity to Attractions",
      "Quality",
      "Restaurant",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Annoyance",
      "Approval",
      "Disappointment",
      "Disapproval",
      "Neutral",
      "Sadness"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_180",
    "rating": 5,
    "date": "2025-08-16",
    "location": null,
    "country": "Unknown",
    "comment": "We are very happy with our stay, everyone is friendly and helpful. We especially enjoyed our day at the cabana, money well spent with excellent service here!",
    "mainClasses": [
      "Service"
    ],
    "subClasses": [
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Joy"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_181",
    "rating": 5,
    "date": "2025-08-16",
    "location": "Southampton, United Kingdom",
    "country": "United Kingdom",
    "comment": "Ahmet roller guy served us drinks all day, he was so lovely and accommodating with us. We had a brilliant stay and will be back next year 😊",
    "mainClasses": [
      "Service",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_182",
    "rating": 5,
    "date": "2025-08-16",
    "location": "Stamford, United Kingdom",
    "country": "United Kingdom",
    "comment": "Great trip with my two kids. Lovely staff, food, pools and entertainment. Our room was great and the drinks were always well stocked and room was spotless.",
    "mainClasses": [
      "Amenities",
      "Room"
    ],
    "subClasses": [
      "Cleanliness",
      "Entertainment"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Love"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_183",
    "rating": 5,
    "date": "2025-08-15",
    "location": null,
    "country": "Unknown",
    "comment": "Excellent hotel, brilliant for kids - has everything you need. Guest relations Mustafa is very helpful and friendly and the Cabana waiter Mustafa is the best you’ll get.",
    "mainClasses": [
      "Amenities",
      "Service"
    ],
    "subClasses": [
      "Entertainment",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_184",
    "rating": 2,
    "date": "2025-08-15",
    "location": null,
    "country": "Unknown",
    "comment": "We are on our last day at the Titanic Deluxe Lara, travelling as a large party of 17. Overall, we had a great holiday and found many aspects of the hotel to be excellent. The hotel staff were accommodating, ensuring our rooms were close together and on the same floor. Rooms were clean, tidy, well-equipped with nice toiletries, and stocked minibars. There are four main pools, all of which were lovely, although securing a sunbed required early starts. By 7am most loungers were already “reserved” with towels. on one occasion we saw guests putting towels out at 2am. Perhaps the hotel could consider adding more sunbeds to ease this. The numerous beach bars serving ice cream, fruit, and drinks were a great addition, with service always friendly and efficient. We booked a pier cabana for several days, the staff there were outstanding, keeping drinks and food flowing all day. The beach itself was fine, though the sea was murkier than expected, not the hotel’s fault. Dining during the day offered good variety, with Greek and Italian sit-down restaurants as alternatives to the buffet. The buffet, however, was very repetitive; by day three, we had tired of seeing largely the same dishes. The Greek and Italian restaurants (with supplements) were well worth it for a change of menu. Evenings were lively, with nightly shows followed by a disco and nightclub. The entertainment and bar staff were fantastic friendly, attentive, and a credit to the hotel. Complaint … Final Night Incident Unfortunately, an incident on our final night left a lasting negative impression. At around 1:45am, I returned to my room to find my key card no longer worked. When I went to reception to have it reactivated, I was told I had an outstanding bill that needed to be paid immediately. I explained that I was happy to settle the bill, but my wallet and cards were in my room. Despite this, the receptionist repeatedly refused to issue me a replacement key unless I paid there and then. I offered for him to come with me to my room so I could retrieve my wallet from the safe and then return to pay, which he initially agreed to. However, after waiting upstairs for 10 minutes, no one arrived. When I returned to reception, I was met with shocking unprofessionalism , the receptionist laughed at me, covered his name badge with his hand when I asked for his name, and flatly refused to give it. When I told him his behaviour was rude, instead of attempting to resolve the situation, he began to argue with me across the reception area as I walked away. He also claimed there was no manager available, despite one being clearly visible nearby. To make matters worse, a young female member of our group experienced the exact same treatment, also being locked out of her room and refused a key. She became visibly upset and cried in front of the staff. I ultimately paid both her bill and mine in cash just to end the ordeal. This behaviour is completely unacceptable, \nLocking paying guests out of their rooms in the early hours is unreasonable, unsafe, and deeply unprofessional. Refusing access to belongings needed to pay the bill is illogical and shows no common sense. Laughing at guests, hiding your name badge to avoid accountability, and arguing instead of resolving the issue is disgraceful customer service. I understand if the hotel requires bills to be settled the day before departure, and I accept that I missed the text reminder. However, the way this was handled was completely wrong and could have been resolved in seconds with a simple apology and agreement to settle the bill first thing in the morning. Sadly, this incident has overshadowed what was otherwise a great week, and because of the way we were treated by the two reception staff, neither I nor the other 17 members of our party would return to this hotel.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Bed",
      "Cleanliness",
      "Entertainment",
      "Fees",
      "Housekeeping",
      "Neighborhood",
      "Noise",
      "Overall Value",
      "Pool",
      "Proximity to Attractions",
      "Restaurant",
      "Sea View",
      "Spa",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Amusement",
      "Approval",
      "Disappointment",
      "Disapproval",
      "Joy",
      "Neutral",
      "Sadness",
      "Surprise"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_185",
    "rating": 5,
    "date": "2025-08-14",
    "location": null,
    "country": "Unknown",
    "comment": "Best Holiday we’ve had in a long time. Hussain on the Cabana was very attentive and made the day special. Great facilities and atmosphere.",
    "mainClasses": [
      "Amenities",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value",
      "Pool"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Joy",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_186",
    "rating": 5,
    "date": "2025-08-14",
    "location": "Amble, United Kingdom",
    "country": "United Kingdom",
    "comment": "Aziz very good with services. Hotel amazing definitely recommend thank you so much Merve from guest relations 🍷🍷🍺🍺🍺☀️☀️☀️🤗🤗🤗",
    "mainClasses": [
      "Service",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Positive"
    ],
    "emotions": [
      "Gratitude"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_187",
    "rating": 5,
    "date": "2025-08-14",
    "location": "Doha, Qatar",
    "country": "Qatar",
    "comment": "5 out of 5 for Yuppi Travels who helped me getting a resort the same day I left Club Arona after experiencing the nightmare of 1 night and 1 day we spent there (paid for 6 nights). Yuppi Tatil is a very good agent I dealt with for the 4th time. I thank very much all Yuppi Tatil Travel team for their professionalism, as I had a booking within one hour time, trying to escape from Club Arona, the night mare!!! Unforgettable stay in Titanic Deluxe Lara. I know already Titanic hotels as I stayed before twice in Titanic Deluxe Belek , in villa with private pool. Full mark for Titanic welcoming, food, entertainments!!",
    "mainClasses": [
      "Amenities",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Overall Value",
      "Pool",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_188",
    "rating": 5,
    "date": "2025-08-14",
    "location": null,
    "country": "Unknown",
    "comment": "Excellent hotel, lovely staff, 3rd staying already booked for next August. Aziz is awesome makes the best cocktails and always goes over and beyond. Cabanas you feel like a VIP.",
    "mainClasses": [
      "Service",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_189",
    "rating": 5,
    "date": "2025-08-14",
    "location": "Tyne and Wear, United Kingdom",
    "country": "United Kingdom",
    "comment": "Very good hotel, very clean and staff are very attentive. Entertainment very good variety of shows, titanic fest was brilliant. Very good variety of food something to suit everyone. We had an issue with our room deposit box, spoke to guest relations and this was resolved within minutes. Fantastic kids club very suitable for all ages and staff very accommodating and helpful. Variety of clubs suitable for all ages.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Room",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Entertainment",
      "Noise",
      "Overall Value",
      "Quality",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_190",
    "rating": 3,
    "date": "2025-08-14",
    "location": "Novosibirsk, Russia",
    "country": "Russia",
    "comment": "Достойный семейный отель, где чувствуешь себя комфортно благодаря продуманному сервису, разнообразному питанию и развлекательной программе. Он особенно подойдёт тем, кто не стремится к ультра-роскоши, а ценит хорошо организованный отдых и дружелюбный персонал. Мы с мужем остались вполне себе довольны, но вернулись бы мы снова сюда- стоит подумать… Однако, если для вас критичны свежесть интерьеров, абсолютная тишина или идеальная современная обстановка — стоит уточнить наличие и сроки завершения ремонтных работ!",
    "mainClasses": [
      "Amenities",
      "Location",
      "Service"
    ],
    "subClasses": [
      "Entertainment",
      "Proximity to Attractions",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_191",
    "rating": 4,
    "date": "2025-08-11",
    "location": "Leigh-on Sea, United Kingdom",
    "country": "United Kingdom",
    "comment": "I just wanted to share a few things. We are currently staying at the Titantic Lara, it is a lovely hotel, but …… \nJust a few little niggles that some people might not mind. If you want a sunbed by the pool you need to be an early riser! I got down the pool at 7.30 and could not find a space with a umbrella. If you don’t mind not having shade there was a few left. I was up early as wanted to reserve/book a cabana on the pier. Cabanas around the pool side and on pier are well over €100, ones on Pier are between €300-€175 depending if you want a jacuzzi or not. You do get some perks with the cabanas like a fridge, food and butler service. We are in a junior suite. The rooms are tired and need refurbishment, also for a suite we only have one tiny bathroom between 2 rooms. Long wait if you order pizza from restaurant leading to the beach ! No hot dog / burger/ chips / kebab that you can take back to your Sun loungers like other hotels on Lara beach . However, lots of waffles, ice cream and cake . The air con is really loud in the room! At the moment other than these little issues overall the hotel is good, food is lovely !!",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room"
    ],
    "subClasses": [
      "Bathroom",
      "Beach",
      "Bed",
      "Breakfast",
      "Entertainment",
      "Noise",
      "Pool",
      "Proximity to Attractions",
      "Quality",
      "Restaurant"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Desire",
      "Excitement",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_192",
    "rating": 5,
    "date": "2025-08-11",
    "location": "Alasehir, Türkiye",
    "country": "Türkiye",
    "comment": "Ağustos 2025 tarihinde 2 yetişkin 2 cocuk olarak konakladık. Bu deneyimimi her yaz farklı lokasyonlar da  5 yıldızlı otellerde tatil yapan birisi olarak paylaşıyorum. Otel sitesinde bulunan fotoğraflarla uyumlu. İlk gün banyoda tıkanıklık yaşadık 15-20 dakika içinde müdahale ettiler tıkanıklık düzeldi. Yemekleri gayet güzel lezzetli, çeşitli , tatlıları ise enfesti. Akşamları özel sushi büfesi bulunmakta. Öğlen ve akşam yemeklerinde kırmızı et ve beyaz et çeşitleri bulunmakta. Oda da sıkışıklık yaşamadık ve  rahattı. Havuzları ve aqua parkı geniş ve temizdi. Cocuk kulübündeki personel ilgili ve güler yüzlüydü çocuklar cok sevdi. Kapıda bileklik uygulaması var ebeveyninin bilgisi olmadan çocuklar dışarı çıkamıyor. Stella Snack Sahilde her öğlen döner yedik ve gayet güzeldi. Stella da bize yardımcı olan Kader hanıma ayriyeten teşekkür ederim çok ilgili ve cana yakındı. Otele girişte valizlerin taşınmasında, araç parkı konusunda ilgisi ve yardımları için Murat AYDIN beye de teşekkür ederim. Gayet eğlenceli neşeli ve mutlu bir tatil geçirdik. Otele naçizane tavsiyem ortak kullanım alanlarında bulunan lavabolara çocukların ellerini yıkaması için boylarına göre ya lavabolar yapılsın yada yükselti yapılırsa çocuklar üzerlerini ıslatmadan daha hijyenik olarak ellerini yıkaya bilirler. Çoğu otelde olduğu gibi havuz başında boş şezlong bulmak için güne erken başlamanız gerekiyor ama sahilde heran boş şezlong bulunmakta.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service"
    ],
    "subClasses": [
      "Bathroom",
      "Entertainment",
      "Neighborhood",
      "Parking",
      "Pool",
      "Proximity to Attractions",
      "Quality",
      "Restaurant",
      "Staff Attitude"
    ],
    "sentiments": [
      "Negative",
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Gratitude",
      "Joy",
      "Love",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_193",
    "rating": 5,
    "date": "2025-08-11",
    "location": null,
    "country": "Unknown",
    "comment": "Eşim ve 2 cocugumla beraber 4-10 Agustos tarihleri arasinda konakladik.Aklima gelenleri ozet olarak yazayim. Oda:Otele erken giris yaptik normalde 14.00 civari teslim edilmesi gereken odaya 11.00 gibi giriş yaptik.Odada ihtiyacımız olan hersey mevcuttu minibar hergun yenilendi,hergun temizlik yapildi. Yemekler:Bu noktada otel inanilmaz kaliteliydi biz ailece kahvalti ve aksam yemeklerinden cok memnun kaldik.Ogle yemeklerinde ana restauranta sadece bir defa gitme gereksinimi duyduk onda da gayet iyiydi.Kahvaltida bir Turk kahvaltisinda akliniza gelebilecek her sicak cesidi istisnasiz vardi.Kullanilan urunler  cok kaliteliydi.Kahvaltida gozleme yapan Hatica abladan cok memnun kaldik.Aksam yemeklerinde muhakkak 2 kirmizi et cesidi ızgara olarak sunuluyor onun haricinde sayilamayacak kadar cok yemek cesidi de vardi.Zaten chefler surekli ortada dolaşıyorlar bir eksiklik varsa aninda mudahale ediyorlar.Snack restoranlari olaganustu Stella Snack restoranda doner pide burger cesitleri var ve inanilmaz lezzetli Berlin donerlerini tavsiye ederim.Italyan snack restoranda da pizza ve makarna cesitleri cok başarılı. Havuz ve Plaj:Havuzlar cok büyük asla havuzda tıkış tıkış hizsetmiyorsunuz evet sezlong sorunu  var onu inkar edemem golgede guzel bir sezlong icin biraz erken kalkip havlu atmaniz gerek ama biz ilk gun saat 11 de havuza indigimizde bile sezlong bulduk.Cocuk aquasi cok guzel yetiskinler de kulanabiliyor biz cok keyif aldik.Yetiskin kaydiraklarinda da 5 kaydirak var gayet eğlendik buna ek olarak yetiskin kaydiraklari biraz daha gelistirilse muazzam olur.Yetiskin ve cocuk aquasinin yanyana olusu cocuklari gozetmemiz acisindan cok iyiydi.Denizini de cok begendik ozellikle sabah saatlerinde ogleye kadar tertemiz bir denizi var.Ogleden sonra biraz dalgali oluyor. Kids Club:Burasi bir cocuk kulubunden cok daha fazlasi.Resmen cocuklar icin ayri bir otel gibi.Resim,seramik,kodlama,muzik gibi pek cok studyo var ozellikle art studio hocamiza buradan tesekkur ediyorum tekrardan.Kikoa Club da nerdeyse her aksam cocuklar icin gosteri programi da var. Eglence:Kaldigimiz 6 gecenin cogunda amfitiyatroda gosteri oldu ve bu gosteriler laf olsun diye yapilan gosteriler degildi hepsi cok kaliteliydi her aksam yemeginde masa masa dolasip gosteri duyurularini yapan Ebru hanima da buradan tesekkur edelim.Gunduz havuz basinda da guzel sutopu musabakalari yaptik cok keyifliydi.Dart, voleybol, futbol gibi oyunlar surekli oynaniyor.Bovling,playstation ucretsiz sadece randevu almaniz gerekli.Bu arada havuz basinda qr kodla siparis veriyorsunuz ayrica patenli arkadaslar zaten gelip surekli soruyor bir ihtiyacınız var mi diye Personel: 1 hafta boyunca hayir,yok,bitti kelimelerini duymadik hepsi de guleryuzle islerini yapıyorlar hepsinden cok memnun kaldik. Ozet olarak eger fiyat cizgisini bozmazsa,abartmazsa seneye baska otel aramadan tekrar rezervasyonumuzu yaptıracağız.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Location",
      "Room",
      "Service"
    ],
    "subClasses": [
      "Accessibility",
      "Beach",
      "Cleanliness",
      "Entertainment",
      "Neighborhood",
      "Restaurant",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Joy",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_194",
    "rating": 5,
    "date": "2025-08-10",
    "location": null,
    "country": "Unknown",
    "comment": "Cabana service is really good Aziz and Ozan are very friendly and welcoming thank you so much i would recommend to friends and family",
    "mainClasses": [
      "Service"
    ],
    "subClasses": [
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Gratitude"
    ],
    "sentiment": "Positive",
    "category": "Service"
  },
  {
    "id": "review_195",
    "rating": 5,
    "date": "2025-08-10",
    "location": "Manchester, United Kingdom",
    "country": "United Kingdom",
    "comment": "The service is amazing, food very high standard, kids club is very interactive, lots of entertainment. Shout out to the team who work so hard to make your holiday enjoyable including Aziz our cabana waitor :)",
    "mainClasses": [
      "Amenities",
      "Service"
    ],
    "subClasses": [
      "Entertainment",
      "Staff Attitude"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Joy"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_196",
    "rating": 5,
    "date": "2025-08-09",
    "location": null,
    "country": "Unknown",
    "comment": "Mal nun bei Ihnen - und wir fühlen uns wie zu Hause! Antalya bietet viele Konkurrenten bezüglich Tourismus, aber wir denken immer an Sie, wenn wir unseren Urlaub planen. Personal, Hygiene, Komfort, Luxus, Erreichbarkeit, Gastronomie, Zimmer, Animationen- ALLES wunderbar. Wir geben 12/10 Punkten. Bis auf eins:\nWir als Gast fühlen uns wohl, allerdings brauchen die Mitarbeiter bei den Handtuchkabinen mindestens einen Ventilator! Es ist so heiß. Wir fühlen uns umso wohler wenn sich auch um das Personal gekümmert wird. Alle sind so herzlich und zuvorkommend. Das ist rein meine Beobachtung, kein Mitarbeiter hat das erwähnt. Allerdings fühle ich mich einfach wohler wenn ich weiß, das Personal ist gut aufgenommen. So wie Sie an uns denken und jeden Ort mit Klima versorgen bitte ich Sie auch die Kabinen/ Räumlichkeiten der Mitarbeiter zu versorgen, wie bspw Handtuch Kabine und weitere Orte ohne Klima/ Ventilator. Bis bald, Ebru Özbek",
    "mainClasses": [
      "Amenities",
      "Location",
      "Service",
      "Value"
    ],
    "subClasses": [
      "Accessibility",
      "Overall Value",
      "Parking",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Approval",
      "Caring",
      "Neutral",
      "Sadness"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_197",
    "rating": 5,
    "date": "2025-08-09",
    "location": null,
    "country": "Unknown",
    "comment": "Beautiful hotel, very clean and amazing food choices. Very close to a lovely clean beach and staff very friendly and helpful.",
    "mainClasses": [
      "Amenities"
    ],
    "subClasses": [
      "Beach",
      "Entertainment"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_198",
    "rating": 5,
    "date": "2025-08-09",
    "location": null,
    "country": "Unknown",
    "comment": "My niece loved the kids club. A really great variety of things to do. The staff, especially Merve was so friendly and helpful. Lots of nice food for the children. Also secure check in with wrists bands if they want to stay on their own.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Service"
    ],
    "subClasses": [
      "Entertainment",
      "Parking",
      "Quality",
      "Staff Attitude"
    ],
    "sentiments": [
      "Neutral",
      "Positive"
    ],
    "emotions": [
      "Admiration",
      "Love",
      "Neutral"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  },
  {
    "id": "review_199",
    "rating": 5,
    "date": "2025-08-09",
    "location": null,
    "country": "Unknown",
    "comment": "Really good hospitality and accommodation. The entertainment was amazing and a great all round holiday. The food and drinks were amazing and you always felt very welcome.",
    "mainClasses": [
      "Amenities",
      "Food",
      "Value"
    ],
    "subClasses": [
      "Overall Value",
      "Pool",
      "Quality"
    ],
    "sentiments": [
      "Positive"
    ],
    "emotions": [
      "Admiration"
    ],
    "sentiment": "Positive",
    "category": "Amenities"
  }
]